kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM34Z5_v1_5.c
void test_DWT(void) {
  (void)DWT_BASE_PTR;
  DWT_CTRL = DWT_CTRL + 1;
  DWT_COMP0 = DWT_COMP0 + 1;
  DWT_MASK0 = DWT_MASK0 + 1;
  DWT_FUNCTION0 = DWT_FUNCTION0 + 1;
  DWT_COMP1 = DWT_COMP1 + 1;
  DWT_MASK1 = DWT_MASK1 + 1;
  DWT_FUNCTION1 = DWT_FUNCTION1 + 1;
  DWT_CTRL_REG(DWT_BASE_PTR) = DWT_CTRL_REG(DWT_BASE_PTR) + 1;
  DWT_COMP_REG(DWT_BASE_PTR,0) = DWT_COMP_REG(DWT_BASE_PTR,0) + 1;
  DWT_COMP(0) = DWT_COMP(0) + 1;
  DWT_MASK_REG(DWT_BASE_PTR,0) = DWT_MASK_REG(DWT_BASE_PTR,0) + 1;
  DWT_MASK(0) = DWT_MASK(0) + 1;
  DWT_FUNCTION_REG(DWT_BASE_PTR,0) = DWT_FUNCTION_REG(DWT_BASE_PTR,0) + 1;
  DWT_FUNCTION(0) = DWT_FUNCTION(0) + 1;
}

void test_EWM(void) {
  (void)EWM_BASE_PTR;
  EWM_CTRL = EWM_CTRL + 1;
  EWM_SERV = EWM_SERV + 1;
  EWM_CMPL = EWM_CMPL + 1;
  EWM_CMPH = EWM_CMPH + 1;
  EWM_CTRL_REG(EWM_BASE_PTR) = EWM_CTRL_REG(EWM_BASE_PTR) + 1;
  (void)EWM_CTRL_EWMEN_MASK;
  (void)EWM_CTRL_EWMEN_SHIFT;
  EWM_CTRL |= EWM_CTRL_EWMEN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_EWMEN_SHIFT);
  (void)EWM_CTRL_ASSIN_MASK;
  (void)EWM_CTRL_ASSIN_SHIFT;
  EWM_CTRL |= EWM_CTRL_ASSIN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_ASSIN_SHIFT);
  (void)EWM_CTRL_INEN_MASK;
  (void)EWM_CTRL_INEN_SHIFT;
  EWM_CTRL |= EWM_CTRL_INEN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_INEN_SHIFT);
  (void)EWM_CTRL_INTEN_MASK;
  (void)EWM_CTRL_INTEN_SHIFT;
  EWM_CTRL |= EWM_CTRL_INTEN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_INTEN_SHIFT);
  EWM_SERV_REG(EWM_BASE_PTR) = EWM_SERV_REG(EWM_BASE_PTR) + 1;
  (void)EWM_SERV_SERVICE_MASK;
  (void)EWM_SERV_SERVICE_SHIFT;
  (void)EWM_SERV_SERVICE(1);
  EWM_SERV |= EWM_SERV_SERVICE_MASK;
  EWM_SERV &= ~(1U << EWM_SERV_SERVICE_SHIFT);
  EWM_CMPL_REG(EWM_BASE_PTR) = EWM_CMPL_REG(EWM_BASE_PTR) + 1;
  (void)EWM_CMPL_COMPAREL_MASK;
  (void)EWM_CMPL_COMPAREL_SHIFT;
  (void)EWM_CMPL_COMPAREL(1);
  EWM_CMPL |= EWM_CMPL_COMPAREL_MASK;
  EWM_CMPL &= ~(1U << EWM_CMPL_COMPAREL_SHIFT);
  EWM_CMPH_REG(EWM_BASE_PTR) = EWM_CMPH_REG(EWM_BASE_PTR) + 1;
  (void)EWM_CMPH_COMPAREH_MASK;
  (void)EWM_CMPH_COMPAREH_SHIFT;
  (void)EWM_CMPH_COMPAREH(1);
  EWM_CMPH |= EWM_CMPH_COMPAREH_MASK;
  EWM_CMPH &= ~(1U << EWM_CMPH_COMPAREH_SHIFT);
}

void test_FTFA(void) {
  (void)FTFA_BASE_PTR;
  FTFA_FSTAT = FTFA_FSTAT + 1;
  FTFA_FCNFG = FTFA_FCNFG + 1;
  FTFA_FCCOB3 = FTFA_FCCOB3 + 1;
  FTFA_FCCOB2 = FTFA_FCCOB2 + 1;
  FTFA_FCCOB1 = FTFA_FCCOB1 + 1;
  FTFA_FCCOB0 = FTFA_FCCOB0 + 1;
  FTFA_FCCOB7 = FTFA_FCCOB7 + 1;
  FTFA_FCCOB6 = FTFA_FCCOB6 + 1;
  FTFA_FCCOB5 = FTFA_FCCOB5 + 1;
  FTFA_FCCOB4 = FTFA_FCCOB4 + 1;
  FTFA_FCCOBB = FTFA_FCCOBB + 1;
  FTFA_FCCOBA = FTFA_FCCOBA + 1;
  FTFA_FCCOB9 = FTFA_FCCOB9 + 1;
  FTFA_FCCOB8 = FTFA_FCCOB8 + 1;
  FTFA_FPROT3 = FTFA_FPROT3 + 1;
  FTFA_FPROT2 = FTFA_FPROT2 + 1;
  FTFA_FPROT1 = FTFA_FPROT1 + 1;
  FTFA_FPROT0 = FTFA_FPROT0 + 1;
  FTFA_FSTAT_REG(FTFA_BASE_PTR) = FTFA_FSTAT_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FSTAT_MGSTAT0_MASK;
  (void)FTFA_FSTAT_MGSTAT0_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_MGSTAT0_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_MGSTAT0_SHIFT);
  (void)FTFA_FSTAT_FPVIOL_MASK;
  (void)FTFA_FSTAT_FPVIOL_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_FPVIOL_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_FPVIOL_SHIFT);
  (void)FTFA_FSTAT_ACCERR_MASK;
  (void)FTFA_FSTAT_ACCERR_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_ACCERR_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_ACCERR_SHIFT);
  (void)FTFA_FSTAT_RDCOLERR_MASK;
  (void)FTFA_FSTAT_RDCOLERR_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_RDCOLERR_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_RDCOLERR_SHIFT);
  (void)FTFA_FSTAT_CCIF_MASK;
  (void)FTFA_FSTAT_CCIF_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_CCIF_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_CCIF_SHIFT);
  FTFA_FCNFG_REG(FTFA_BASE_PTR) = FTFA_FCNFG_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCNFG_ERSSUSP_MASK;
  (void)FTFA_FCNFG_ERSSUSP_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_ERSSUSP_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_ERSSUSP_SHIFT);
  (void)FTFA_FCNFG_ERSAREQ_MASK;
  (void)FTFA_FCNFG_ERSAREQ_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_ERSAREQ_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_ERSAREQ_SHIFT);
  (void)FTFA_FCNFG_RDCOLLIE_MASK;
  (void)FTFA_FCNFG_RDCOLLIE_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_RDCOLLIE_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_RDCOLLIE_SHIFT);
  (void)FTFA_FCNFG_CCIE_MASK;
  (void)FTFA_FCNFG_CCIE_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_CCIE_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_CCIE_SHIFT);
  (void)FTFA_FSEC_SEC_MASK;
  (void)FTFA_FSEC_SEC_SHIFT;
  (void)FTFA_FSEC_SEC(1);
  FTFA_FSEC |= FTFA_FSEC_SEC_MASK;
  FTFA_FSEC &= ~(1U << FTFA_FSEC_SEC_SHIFT);
  (void)FTFA_FSEC_FSLACC_MASK;
  (void)FTFA_FSEC_FSLACC_SHIFT;
  (void)FTFA_FSEC_FSLACC(1);
  FTFA_FSEC |= FTFA_FSEC_FSLACC_MASK;
  FTFA_FSEC &= ~(1U << FTFA_FSEC_FSLACC_SHIFT);
  (void)FTFA_FSEC_MEEN_MASK;
  (void)FTFA_FSEC_MEEN_SHIFT;
  (void)FTFA_FSEC_MEEN(1);
  FTFA_FSEC |= FTFA_FSEC_MEEN_MASK;
  FTFA_FSEC &= ~(1U << FTFA_FSEC_MEEN_SHIFT);
  (void)FTFA_FSEC_KEYEN_MASK;
  (void)FTFA_FSEC_KEYEN_SHIFT;
  (void)FTFA_FSEC_KEYEN(1);
  FTFA_FSEC |= FTFA_FSEC_KEYEN_MASK;
  FTFA_FSEC &= ~(1U << FTFA_FSEC_KEYEN_SHIFT);
  (void)FTFA_FOPT_OPT_MASK;
  (void)FTFA_FOPT_OPT_SHIFT;
  (void)FTFA_FOPT_OPT(1);
  FTFA_FOPT |= FTFA_FOPT_OPT_MASK;
  FTFA_FOPT &= ~(1U << FTFA_FOPT_OPT_SHIFT);
  FTFA_FCCOB3_REG(FTFA_BASE_PTR) = FTFA_FCCOB3_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB3_CCOBn_MASK;
  (void)FTFA_FCCOB3_CCOBn_SHIFT;
  (void)FTFA_FCCOB3_CCOBn(1);
  FTFA_FCCOB3 |= FTFA_FCCOB3_CCOBn_MASK;
  FTFA_FCCOB3 &= ~(1U << FTFA_FCCOB3_CCOBn_SHIFT);
  FTFA_FCCOB2_REG(FTFA_BASE_PTR) = FTFA_FCCOB2_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB2_CCOBn_MASK;
  (void)FTFA_FCCOB2_CCOBn_SHIFT;
  (void)FTFA_FCCOB2_CCOBn(1);
  FTFA_FCCOB2 |= FTFA_FCCOB2_CCOBn_MASK;
  FTFA_FCCOB2 &= ~(1U << FTFA_FCCOB2_CCOBn_SHIFT);
  FTFA_FCCOB1_REG(FTFA_BASE_PTR) = FTFA_FCCOB1_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB1_CCOBn_MASK;
  (void)FTFA_FCCOB1_CCOBn_SHIFT;
  (void)FTFA_FCCOB1_CCOBn(1);
  FTFA_FCCOB1 |= FTFA_FCCOB1_CCOBn_MASK;
  FTFA_FCCOB1 &= ~(1U << FTFA_FCCOB1_CCOBn_SHIFT);
  FTFA_FCCOB0_REG(FTFA_BASE_PTR) = FTFA_FCCOB0_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB0_CCOBn_MASK;
  (void)FTFA_FCCOB0_CCOBn_SHIFT;
  (void)FTFA_FCCOB0_CCOBn(1);
  FTFA_FCCOB0 |= FTFA_FCCOB0_CCOBn_MASK;
  FTFA_FCCOB0 &= ~(1U << FTFA_FCCOB0_CCOBn_SHIFT);
  FTFA_FCCOB7_REG(FTFA_BASE_PTR) = FTFA_FCCOB7_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB7_CCOBn_MASK;
  (void)FTFA_FCCOB7_CCOBn_SHIFT;
  (void)FTFA_FCCOB7_CCOBn(1);
  FTFA_FCCOB7 |= FTFA_FCCOB7_CCOBn_MASK;
  FTFA_FCCOB7 &= ~(1U << FTFA_FCCOB7_CCOBn_SHIFT);
  FTFA_FCCOB6_REG(FTFA_BASE_PTR) = FTFA_FCCOB6_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB6_CCOBn_MASK;
  (void)FTFA_FCCOB6_CCOBn_SHIFT;
  (void)FTFA_FCCOB6_CCOBn(1);
  FTFA_FCCOB6 |= FTFA_FCCOB6_CCOBn_MASK;
  FTFA_FCCOB6 &= ~(1U << FTFA_FCCOB6_CCOBn_SHIFT);
  FTFA_FCCOB5_REG(FTFA_BASE_PTR) = FTFA_FCCOB5_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB5_CCOBn_MASK;
  (void)FTFA_FCCOB5_CCOBn_SHIFT;
  (void)FTFA_FCCOB5_CCOBn(1);
  FTFA_FCCOB5 |= FTFA_FCCOB5_CCOBn_MASK;
  FTFA_FCCOB5 &= ~(1U << FTFA_FCCOB5_CCOBn_SHIFT);
  FTFA_FCCOB4_REG(FTFA_BASE_PTR) = FTFA_FCCOB4_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB4_CCOBn_MASK;
  (void)FTFA_FCCOB4_CCOBn_SHIFT;
  (void)FTFA_FCCOB4_CCOBn(1);
  FTFA_FCCOB4 |= FTFA_FCCOB4_CCOBn_MASK;
  FTFA_FCCOB4 &= ~(1U << FTFA_FCCOB4_CCOBn_SHIFT);
  FTFA_FCCOBB_REG(FTFA_BASE_PTR) = FTFA_FCCOBB_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOBB_CCOBn_MASK;
  (void)FTFA_FCCOBB_CCOBn_SHIFT;
  (void)FTFA_FCCOBB_CCOBn(1);
  FTFA_FCCOBB |= FTFA_FCCOBB_CCOBn_MASK;
  FTFA_FCCOBB &= ~(1U << FTFA_FCCOBB_CCOBn_SHIFT);
  FTFA_FCCOBA_REG(FTFA_BASE_PTR) = FTFA_FCCOBA_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOBA_CCOBn_MASK;
  (void)FTFA_FCCOBA_CCOBn_SHIFT;
  (void)FTFA_FCCOBA_CCOBn(1);
  FTFA_FCCOBA |= FTFA_FCCOBA_CCOBn_MASK;
  FTFA_FCCOBA &= ~(1U << FTFA_FCCOBA_CCOBn_SHIFT);
  FTFA_FCCOB9_REG(FTFA_BASE_PTR) = FTFA_FCCOB9_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB9_CCOBn_MASK;
  (void)FTFA_FCCOB9_CCOBn_SHIFT;
  (void)FTFA_FCCOB9_CCOBn(1);
  FTFA_FCCOB9 |= FTFA_FCCOB9_CCOBn_MASK;
  FTFA_FCCOB9 &= ~(1U << FTFA_FCCOB9_CCOBn_SHIFT);
  FTFA_FCCOB8_REG(FTFA_BASE_PTR) = FTFA_FCCOB8_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FCCOB8_CCOBn_MASK;
  (void)FTFA_FCCOB8_CCOBn_SHIFT;
  (void)FTFA_FCCOB8_CCOBn(1);
  FTFA_FCCOB8 |= FTFA_FCCOB8_CCOBn_MASK;
  FTFA_FCCOB8 &= ~(1U << FTFA_FCCOB8_CCOBn_SHIFT);
  FTFA_FPROT3_REG(FTFA_BASE_PTR) = FTFA_FPROT3_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FPROT3_PROT_MASK;
  (void)FTFA_FPROT3_PROT_SHIFT;
  (void)FTFA_FPROT3_PROT(1);
  FTFA_FPROT3 |= FTFA_FPROT3_PROT_MASK;
  FTFA_FPROT3 &= ~(1U << FTFA_FPROT3_PROT_SHIFT);
  FTFA_FPROT2_REG(FTFA_BASE_PTR) = FTFA_FPROT2_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FPROT2_PROT_MASK;
  (void)FTFA_FPROT2_PROT_SHIFT;
  (void)FTFA_FPROT2_PROT(1);
  FTFA_FPROT2 |= FTFA_FPROT2_PROT_MASK;
  FTFA_FPROT2 &= ~(1U << FTFA_FPROT2_PROT_SHIFT);
  FTFA_FPROT1_REG(FTFA_BASE_PTR) = FTFA_FPROT1_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FPROT1_PROT_MASK;
  (void)FTFA_FPROT1_PROT_SHIFT;
  (void)FTFA_FPROT1_PROT(1);
  FTFA_FPROT1 |= FTFA_FPROT1_PROT_MASK;
  FTFA_FPROT1 &= ~(1U << FTFA_FPROT1_PROT_SHIFT);
  FTFA_FPROT0_REG(FTFA_BASE_PTR) = FTFA_FPROT0_REG(FTFA_BASE_PTR) + 1;
  (void)FTFA_FPROT0_PROT_MASK;
  (void)FTFA_FPROT0_PROT_SHIFT;
  (void)FTFA_FPROT0_PROT(1);
  FTFA_FPROT0 |= FTFA_FPROT0_PROT_MASK;
  FTFA_FPROT0 &= ~(1U << FTFA_FPROT0_PROT_SHIFT);
}

