kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM34Z5_v1_5.c
void test_LLWU(void) {
  (void)LLWU_BASE_PTR;
  LLWU_PE1 = LLWU_PE1 + 1;
  LLWU_PE2 = LLWU_PE2 + 1;
  LLWU_PE3 = LLWU_PE3 + 1;
  LLWU_PE4 = LLWU_PE4 + 1;
  LLWU_ME = LLWU_ME + 1;
  LLWU_F1 = LLWU_F1 + 1;
  LLWU_F2 = LLWU_F2 + 1;
  LLWU_FILT1 = LLWU_FILT1 + 1;
  LLWU_FILT2 = LLWU_FILT2 + 1;
  LLWU_PE1_REG(LLWU_BASE_PTR) = LLWU_PE1_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_PE1_WUPE0_MASK;
  (void)LLWU_PE1_WUPE0_SHIFT;
  (void)LLWU_PE1_WUPE0(1);
  LLWU_PE1 |= LLWU_PE1_WUPE0_MASK;
  LLWU_PE1 &= ~(1U << LLWU_PE1_WUPE0_SHIFT);
  (void)LLWU_PE1_WUPE1_MASK;
  (void)LLWU_PE1_WUPE1_SHIFT;
  (void)LLWU_PE1_WUPE1(1);
  LLWU_PE1 |= LLWU_PE1_WUPE1_MASK;
  LLWU_PE1 &= ~(1U << LLWU_PE1_WUPE1_SHIFT);
  (void)LLWU_PE1_WUPE2_MASK;
  (void)LLWU_PE1_WUPE2_SHIFT;
  (void)LLWU_PE1_WUPE2(1);
  LLWU_PE1 |= LLWU_PE1_WUPE2_MASK;
  LLWU_PE1 &= ~(1U << LLWU_PE1_WUPE2_SHIFT);
  (void)LLWU_PE1_WUPE3_MASK;
  (void)LLWU_PE1_WUPE3_SHIFT;
  (void)LLWU_PE1_WUPE3(1);
  LLWU_PE1 |= LLWU_PE1_WUPE3_MASK;
  LLWU_PE1 &= ~(1U << LLWU_PE1_WUPE3_SHIFT);
  LLWU_PE2_REG(LLWU_BASE_PTR) = LLWU_PE2_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_PE2_WUPE4_MASK;
  (void)LLWU_PE2_WUPE4_SHIFT;
  (void)LLWU_PE2_WUPE4(1);
  LLWU_PE2 |= LLWU_PE2_WUPE4_MASK;
  LLWU_PE2 &= ~(1U << LLWU_PE2_WUPE4_SHIFT);
  (void)LLWU_PE2_WUPE5_MASK;
  (void)LLWU_PE2_WUPE5_SHIFT;
  (void)LLWU_PE2_WUPE5(1);
  LLWU_PE2 |= LLWU_PE2_WUPE5_MASK;
  LLWU_PE2 &= ~(1U << LLWU_PE2_WUPE5_SHIFT);
  (void)LLWU_PE2_WUPE6_MASK;
  (void)LLWU_PE2_WUPE6_SHIFT;
  (void)LLWU_PE2_WUPE6(1);
  LLWU_PE2 |= LLWU_PE2_WUPE6_MASK;
  LLWU_PE2 &= ~(1U << LLWU_PE2_WUPE6_SHIFT);
  (void)LLWU_PE2_WUPE7_MASK;
  (void)LLWU_PE2_WUPE7_SHIFT;
  (void)LLWU_PE2_WUPE7(1);
  LLWU_PE2 |= LLWU_PE2_WUPE7_MASK;
  LLWU_PE2 &= ~(1U << LLWU_PE2_WUPE7_SHIFT);
  LLWU_PE3_REG(LLWU_BASE_PTR) = LLWU_PE3_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_PE3_WUPE8_MASK;
  (void)LLWU_PE3_WUPE8_SHIFT;
  (void)LLWU_PE3_WUPE8(1);
  LLWU_PE3 |= LLWU_PE3_WUPE8_MASK;
  LLWU_PE3 &= ~(1U << LLWU_PE3_WUPE8_SHIFT);
  (void)LLWU_PE3_WUPE9_MASK;
  (void)LLWU_PE3_WUPE9_SHIFT;
  (void)LLWU_PE3_WUPE9(1);
  LLWU_PE3 |= LLWU_PE3_WUPE9_MASK;
  LLWU_PE3 &= ~(1U << LLWU_PE3_WUPE9_SHIFT);
  (void)LLWU_PE3_WUPE10_MASK;
  (void)LLWU_PE3_WUPE10_SHIFT;
  (void)LLWU_PE3_WUPE10(1);
  LLWU_PE3 |= LLWU_PE3_WUPE10_MASK;
  LLWU_PE3 &= ~(1U << LLWU_PE3_WUPE10_SHIFT);
  (void)LLWU_PE3_WUPE11_MASK;
  (void)LLWU_PE3_WUPE11_SHIFT;
  (void)LLWU_PE3_WUPE11(1);
  LLWU_PE3 |= LLWU_PE3_WUPE11_MASK;
  LLWU_PE3 &= ~(1U << LLWU_PE3_WUPE11_SHIFT);
  LLWU_PE4_REG(LLWU_BASE_PTR) = LLWU_PE4_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_PE4_WUPE12_MASK;
  (void)LLWU_PE4_WUPE12_SHIFT;
  (void)LLWU_PE4_WUPE12(1);
  LLWU_PE4 |= LLWU_PE4_WUPE12_MASK;
  LLWU_PE4 &= ~(1U << LLWU_PE4_WUPE12_SHIFT);
  (void)LLWU_PE4_WUPE13_MASK;
  (void)LLWU_PE4_WUPE13_SHIFT;
  (void)LLWU_PE4_WUPE13(1);
  LLWU_PE4 |= LLWU_PE4_WUPE13_MASK;
  LLWU_PE4 &= ~(1U << LLWU_PE4_WUPE13_SHIFT);
  (void)LLWU_PE4_WUPE14_MASK;
  (void)LLWU_PE4_WUPE14_SHIFT;
  (void)LLWU_PE4_WUPE14(1);
  LLWU_PE4 |= LLWU_PE4_WUPE14_MASK;
  LLWU_PE4 &= ~(1U << LLWU_PE4_WUPE14_SHIFT);
  (void)LLWU_PE4_WUPE15_MASK;
  (void)LLWU_PE4_WUPE15_SHIFT;
  (void)LLWU_PE4_WUPE15(1);
  LLWU_PE4 |= LLWU_PE4_WUPE15_MASK;
  LLWU_PE4 &= ~(1U << LLWU_PE4_WUPE15_SHIFT);
  LLWU_ME_REG(LLWU_BASE_PTR) = LLWU_ME_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_ME_WUME0_MASK;
  (void)LLWU_ME_WUME0_SHIFT;
  LLWU_ME |= LLWU_ME_WUME0_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME0_SHIFT);
  (void)LLWU_ME_WUME1_MASK;
  (void)LLWU_ME_WUME1_SHIFT;
  LLWU_ME |= LLWU_ME_WUME1_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME1_SHIFT);
  (void)LLWU_ME_WUME2_MASK;
  (void)LLWU_ME_WUME2_SHIFT;
  LLWU_ME |= LLWU_ME_WUME2_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME2_SHIFT);
  (void)LLWU_ME_WUME3_MASK;
  (void)LLWU_ME_WUME3_SHIFT;
  LLWU_ME |= LLWU_ME_WUME3_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME3_SHIFT);
  (void)LLWU_ME_WUME4_MASK;
  (void)LLWU_ME_WUME4_SHIFT;
  LLWU_ME |= LLWU_ME_WUME4_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME4_SHIFT);
  (void)LLWU_ME_WUME5_MASK;
  (void)LLWU_ME_WUME5_SHIFT;
  LLWU_ME |= LLWU_ME_WUME5_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME5_SHIFT);
  (void)LLWU_ME_WUME6_MASK;
  (void)LLWU_ME_WUME6_SHIFT;
  LLWU_ME |= LLWU_ME_WUME6_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME6_SHIFT);
  (void)LLWU_ME_WUME7_MASK;
  (void)LLWU_ME_WUME7_SHIFT;
  LLWU_ME |= LLWU_ME_WUME7_MASK;
  LLWU_ME &= ~(1U << LLWU_ME_WUME7_SHIFT);
  LLWU_F1_REG(LLWU_BASE_PTR) = LLWU_F1_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_F1_WUF0_MASK;
  (void)LLWU_F1_WUF0_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF0_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF0_SHIFT);
  (void)LLWU_F1_WUF1_MASK;
  (void)LLWU_F1_WUF1_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF1_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF1_SHIFT);
  (void)LLWU_F1_WUF2_MASK;
  (void)LLWU_F1_WUF2_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF2_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF2_SHIFT);
  (void)LLWU_F1_WUF3_MASK;
  (void)LLWU_F1_WUF3_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF3_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF3_SHIFT);
  (void)LLWU_F1_WUF4_MASK;
  (void)LLWU_F1_WUF4_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF4_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF4_SHIFT);
  (void)LLWU_F1_WUF5_MASK;
  (void)LLWU_F1_WUF5_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF5_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF5_SHIFT);
  (void)LLWU_F1_WUF6_MASK;
  (void)LLWU_F1_WUF6_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF6_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF6_SHIFT);
  (void)LLWU_F1_WUF7_MASK;
  (void)LLWU_F1_WUF7_SHIFT;
  LLWU_F1 |= LLWU_F1_WUF7_MASK;
  LLWU_F1 &= ~(1U << LLWU_F1_WUF7_SHIFT);
  LLWU_F2_REG(LLWU_BASE_PTR) = LLWU_F2_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_F2_WUF8_MASK;
  (void)LLWU_F2_WUF8_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF8_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF8_SHIFT);
  (void)LLWU_F2_WUF9_MASK;
  (void)LLWU_F2_WUF9_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF9_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF9_SHIFT);
  (void)LLWU_F2_WUF10_MASK;
  (void)LLWU_F2_WUF10_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF10_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF10_SHIFT);
  (void)LLWU_F2_WUF11_MASK;
  (void)LLWU_F2_WUF11_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF11_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF11_SHIFT);
  (void)LLWU_F2_WUF12_MASK;
  (void)LLWU_F2_WUF12_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF12_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF12_SHIFT);
  (void)LLWU_F2_WUF13_MASK;
  (void)LLWU_F2_WUF13_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF13_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF13_SHIFT);
  (void)LLWU_F2_WUF14_MASK;
  (void)LLWU_F2_WUF14_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF14_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF14_SHIFT);
  (void)LLWU_F2_WUF15_MASK;
  (void)LLWU_F2_WUF15_SHIFT;
  LLWU_F2 |= LLWU_F2_WUF15_MASK;
  LLWU_F2 &= ~(1U << LLWU_F2_WUF15_SHIFT);
  (void)LLWU_F3_MWUF0_MASK;
  (void)LLWU_F3_MWUF0_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF0_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF0_SHIFT);
  (void)LLWU_F3_MWUF1_MASK;
  (void)LLWU_F3_MWUF1_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF1_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF1_SHIFT);
  (void)LLWU_F3_MWUF2_MASK;
  (void)LLWU_F3_MWUF2_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF2_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF2_SHIFT);
  (void)LLWU_F3_MWUF3_MASK;
  (void)LLWU_F3_MWUF3_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF3_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF3_SHIFT);
  (void)LLWU_F3_MWUF4_MASK;
  (void)LLWU_F3_MWUF4_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF4_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF4_SHIFT);
  (void)LLWU_F3_MWUF5_MASK;
  (void)LLWU_F3_MWUF5_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF5_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF5_SHIFT);
  (void)LLWU_F3_MWUF6_MASK;
  (void)LLWU_F3_MWUF6_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF6_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF6_SHIFT);
  (void)LLWU_F3_MWUF7_MASK;
  (void)LLWU_F3_MWUF7_SHIFT;
  LLWU_F3 |= LLWU_F3_MWUF7_MASK;
  LLWU_F3 &= ~(1U << LLWU_F3_MWUF7_SHIFT);
  LLWU_FILT1_REG(LLWU_BASE_PTR) = LLWU_FILT1_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_FILT1_FILTSEL_MASK;
  (void)LLWU_FILT1_FILTSEL_SHIFT;
  (void)LLWU_FILT1_FILTSEL(1);
  LLWU_FILT1 |= LLWU_FILT1_FILTSEL_MASK;
  LLWU_FILT1 &= ~(1U << LLWU_FILT1_FILTSEL_SHIFT);
  (void)LLWU_FILT1_FILTE_MASK;
  (void)LLWU_FILT1_FILTE_SHIFT;
  (void)LLWU_FILT1_FILTE(1);
  LLWU_FILT1 |= LLWU_FILT1_FILTE_MASK;
  LLWU_FILT1 &= ~(1U << LLWU_FILT1_FILTE_SHIFT);
  (void)LLWU_FILT1_FILTF_MASK;
  (void)LLWU_FILT1_FILTF_SHIFT;
  LLWU_FILT1 |= LLWU_FILT1_FILTF_MASK;
  LLWU_FILT1 &= ~(1U << LLWU_FILT1_FILTF_SHIFT);
  LLWU_FILT2_REG(LLWU_BASE_PTR) = LLWU_FILT2_REG(LLWU_BASE_PTR) + 1;
  (void)LLWU_FILT2_FILTSEL_MASK;
  (void)LLWU_FILT2_FILTSEL_SHIFT;
  (void)LLWU_FILT2_FILTSEL(1);
  LLWU_FILT2 |= LLWU_FILT2_FILTSEL_MASK;
  LLWU_FILT2 &= ~(1U << LLWU_FILT2_FILTSEL_SHIFT);
  (void)LLWU_FILT2_FILTE_MASK;
  (void)LLWU_FILT2_FILTE_SHIFT;
  (void)LLWU_FILT2_FILTE(1);
  LLWU_FILT2 |= LLWU_FILT2_FILTE_MASK;
  LLWU_FILT2 &= ~(1U << LLWU_FILT2_FILTE_SHIFT);
  (void)LLWU_FILT2_FILTF_MASK;
  (void)LLWU_FILT2_FILTF_SHIFT;
  LLWU_FILT2 |= LLWU_FILT2_FILTF_MASK;
  LLWU_FILT2 &= ~(1U << LLWU_FILT2_FILTF_SHIFT);
}

void test_LPTMR(void) {
  (void)LPTMR_BASE_PTR;
  LPTMR_CSR = LPTMR_CSR + 1;
  LPTMR_PSR = LPTMR_PSR + 1;
  LPTMR_CMR = LPTMR_CMR + 1;
  LPTMR_CNR = LPTMR_CNR + 1;
  LPTMR_CSR_REG(LPTMR_BASE_PTR) = LPTMR_CSR_REG(LPTMR_BASE_PTR) + 1;
  (void)LPTMR_CSR_TEN_MASK;
  (void)LPTMR_CSR_TEN_SHIFT;
  LPTMR_CSR |= LPTMR_CSR_TEN_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TEN_SHIFT);
  (void)LPTMR_CSR_TMS_MASK;
  (void)LPTMR_CSR_TMS_SHIFT;
  LPTMR_CSR |= LPTMR_CSR_TMS_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TMS_SHIFT);
  (void)LPTMR_CSR_TFC_MASK;
  (void)LPTMR_CSR_TFC_SHIFT;
  LPTMR_CSR |= LPTMR_CSR_TFC_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TFC_SHIFT);
  (void)LPTMR_CSR_TPP_MASK;
  (void)LPTMR_CSR_TPP_SHIFT;
  LPTMR_CSR |= LPTMR_CSR_TPP_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TPP_SHIFT);
  (void)LPTMR_CSR_TPS_MASK;
  (void)LPTMR_CSR_TPS_SHIFT;
  (void)LPTMR_CSR_TPS(1);
  LPTMR_CSR |= LPTMR_CSR_TPS_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TPS_SHIFT);
  (void)LPTMR_CSR_TIE_MASK;
  (void)LPTMR_CSR_TIE_SHIFT;
  LPTMR_CSR |= LPTMR_CSR_TIE_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TIE_SHIFT);
  (void)LPTMR_CSR_TCF_MASK;
  (void)LPTMR_CSR_TCF_SHIFT;
  LPTMR_CSR |= LPTMR_CSR_TCF_MASK;
  LPTMR_CSR &= ~(1U << LPTMR_CSR_TCF_SHIFT);
  LPTMR_PSR_REG(LPTMR_BASE_PTR) = LPTMR_PSR_REG(LPTMR_BASE_PTR) + 1;
  (void)LPTMR_PSR_PCS_MASK;
  (void)LPTMR_PSR_PCS_SHIFT;
  (void)LPTMR_PSR_PCS(1);
  LPTMR_PSR |= LPTMR_PSR_PCS_MASK;
  LPTMR_PSR &= ~(1U << LPTMR_PSR_PCS_SHIFT);
  (void)LPTMR_PSR_PBYP_MASK;
  (void)LPTMR_PSR_PBYP_SHIFT;
  LPTMR_PSR |= LPTMR_PSR_PBYP_MASK;
  LPTMR_PSR &= ~(1U << LPTMR_PSR_PBYP_SHIFT);
  (void)LPTMR_PSR_PRESCALE_MASK;
  (void)LPTMR_PSR_PRESCALE_SHIFT;
  (void)LPTMR_PSR_PRESCALE(1);
  LPTMR_PSR |= LPTMR_PSR_PRESCALE_MASK;
  LPTMR_PSR &= ~(1U << LPTMR_PSR_PRESCALE_SHIFT);
  LPTMR_CMR_REG(LPTMR_BASE_PTR) = LPTMR_CMR_REG(LPTMR_BASE_PTR) + 1;
  (void)LPTMR_CMR_COMPARE_MASK;
  (void)LPTMR_CMR_COMPARE_SHIFT;
  (void)LPTMR_CMR_COMPARE(1);
  LPTMR_CMR |= LPTMR_CMR_COMPARE_MASK;
  LPTMR_CMR &= ~(1U << LPTMR_CMR_COMPARE_SHIFT);
  LPTMR_CNR_REG(LPTMR_BASE_PTR) = LPTMR_CNR_REG(LPTMR_BASE_PTR) + 1;
  (void)LPTMR_CNR_COUNTER_MASK;
  (void)LPTMR_CNR_COUNTER_SHIFT;
  (void)LPTMR_CNR_COUNTER(1);
  LPTMR_CNR |= LPTMR_CNR_COUNTER_MASK;
  LPTMR_CNR &= ~(1U << LPTMR_CNR_COUNTER_SHIFT);
}

void test_MCG(void) {
  (void)MCG_BASE_PTR;
  MCG_C1 = MCG_C1 + 1;
  MCG_C2 = MCG_C2 + 1;
  MCG_C3 = MCG_C3 + 1;
  MCG_C4 = MCG_C4 + 1;
  MCG_C5 = MCG_C5 + 1;
  MCG_C6 = MCG_C6 + 1;
  MCG_S = MCG_S + 1;
  MCG_SC = MCG_SC + 1;
  MCG_ATCVH = MCG_ATCVH + 1;
  MCG_ATCVL = MCG_ATCVL + 1;
  MCG_C7 = MCG_C7 + 1;
  MCG_C8 = MCG_C8 + 1;
  MCG_C1_REG(MCG_BASE_PTR) = MCG_C1_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C1_IREFSTEN_MASK;
  (void)MCG_C1_IREFSTEN_SHIFT;
  MCG_C1 |= MCG_C1_IREFSTEN_MASK;
  MCG_C1 &= ~(1U << MCG_C1_IREFSTEN_SHIFT);
  (void)MCG_C1_IRCLKEN_MASK;
  (void)MCG_C1_IRCLKEN_SHIFT;
  MCG_C1 |= MCG_C1_IRCLKEN_MASK;
  MCG_C1 &= ~(1U << MCG_C1_IRCLKEN_SHIFT);
  (void)MCG_C1_IREFS_MASK;
  (void)MCG_C1_IREFS_SHIFT;
  MCG_C1 |= MCG_C1_IREFS_MASK;
  MCG_C1 &= ~(1U << MCG_C1_IREFS_SHIFT);
  (void)MCG_C1_FRDIV_MASK;
  (void)MCG_C1_FRDIV_SHIFT;
  (void)MCG_C1_FRDIV(1);
  MCG_C1 |= MCG_C1_FRDIV_MASK;
  MCG_C1 &= ~(1U << MCG_C1_FRDIV_SHIFT);
  (void)MCG_C1_CLKS_MASK;
  (void)MCG_C1_CLKS_SHIFT;
  (void)MCG_C1_CLKS(1);
  MCG_C1 |= MCG_C1_CLKS_MASK;
  MCG_C1 &= ~(1U << MCG_C1_CLKS_SHIFT);
  MCG_C2_REG(MCG_BASE_PTR) = MCG_C2_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C2_IRCS_MASK;
  (void)MCG_C2_IRCS_SHIFT;
  MCG_C2 |= MCG_C2_IRCS_MASK;
  MCG_C2 &= ~(1U << MCG_C2_IRCS_SHIFT);
  (void)MCG_C2_LP_MASK;
  (void)MCG_C2_LP_SHIFT;
  MCG_C2 |= MCG_C2_LP_MASK;
  MCG_C2 &= ~(1U << MCG_C2_LP_SHIFT);
  (void)MCG_C2_EREFS0_MASK;
  (void)MCG_C2_EREFS0_SHIFT;
  MCG_C2 |= MCG_C2_EREFS0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_EREFS0_SHIFT);
  (void)MCG_C2_HGO0_MASK;
  (void)MCG_C2_HGO0_SHIFT;
  MCG_C2 |= MCG_C2_HGO0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_HGO0_SHIFT);
  (void)MCG_C2_RANGE0_MASK;
  (void)MCG_C2_RANGE0_SHIFT;
  (void)MCG_C2_RANGE0(1);
  MCG_C2 |= MCG_C2_RANGE0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_RANGE0_SHIFT);
  (void)MCG_C2_LOCRE0_MASK;
  (void)MCG_C2_LOCRE0_SHIFT;
  MCG_C2 |= MCG_C2_LOCRE0_MASK;
  MCG_C2 &= ~(1U << MCG_C2_LOCRE0_SHIFT);
  MCG_C3_REG(MCG_BASE_PTR) = MCG_C3_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C3_SCTRIM_MASK;
  (void)MCG_C3_SCTRIM_SHIFT;
  (void)MCG_C3_SCTRIM(1);
  MCG_C3 |= MCG_C3_SCTRIM_MASK;
  MCG_C3 &= ~(1U << MCG_C3_SCTRIM_SHIFT);
  MCG_C4_REG(MCG_BASE_PTR) = MCG_C4_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C4_SCFTRIM_MASK;
  (void)MCG_C4_SCFTRIM_SHIFT;
  MCG_C4 |= MCG_C4_SCFTRIM_MASK;
  MCG_C4 &= ~(1U << MCG_C4_SCFTRIM_SHIFT);
  (void)MCG_C4_FCTRIM_MASK;
  (void)MCG_C4_FCTRIM_SHIFT;
  (void)MCG_C4_FCTRIM(1);
  MCG_C4 |= MCG_C4_FCTRIM_MASK;
  MCG_C4 &= ~(1U << MCG_C4_FCTRIM_SHIFT);
  (void)MCG_C4_DRST_DRS_MASK;
  (void)MCG_C4_DRST_DRS_SHIFT;
  (void)MCG_C4_DRST_DRS(1);
  MCG_C4 |= MCG_C4_DRST_DRS_MASK;
  MCG_C4 &= ~(1U << MCG_C4_DRST_DRS_SHIFT);
  (void)MCG_C4_DMX32_MASK;
  (void)MCG_C4_DMX32_SHIFT;
  MCG_C4 |= MCG_C4_DMX32_MASK;
  MCG_C4 &= ~(1U << MCG_C4_DMX32_SHIFT);
  MCG_C5_REG(MCG_BASE_PTR) = MCG_C5_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C5_PLLSTEN0_MASK;
  (void)MCG_C5_PLLSTEN0_SHIFT;
  MCG_C5 |= MCG_C5_PLLSTEN0_MASK;
  MCG_C5 &= ~(1U << MCG_C5_PLLSTEN0_SHIFT);
  (void)MCG_C5_PLLCLKEN0_MASK;
  (void)MCG_C5_PLLCLKEN0_SHIFT;
  MCG_C5 |= MCG_C5_PLLCLKEN0_MASK;
  MCG_C5 &= ~(1U << MCG_C5_PLLCLKEN0_SHIFT);
  MCG_C6_REG(MCG_BASE_PTR) = MCG_C6_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C6_CHGPMP_BIAS_MASK;
  (void)MCG_C6_CHGPMP_BIAS_SHIFT;
  (void)MCG_C6_CHGPMP_BIAS(1);
  MCG_C6 |= MCG_C6_CHGPMP_BIAS_MASK;
  MCG_C6 &= ~(1U << MCG_C6_CHGPMP_BIAS_SHIFT);
  (void)MCG_C6_CME0_MASK;
  (void)MCG_C6_CME0_SHIFT;
  MCG_C6 |= MCG_C6_CME0_MASK;
  MCG_C6 &= ~(1U << MCG_C6_CME0_SHIFT);
  (void)MCG_C6_PLLS_MASK;
  (void)MCG_C6_PLLS_SHIFT;
  MCG_C6 |= MCG_C6_PLLS_MASK;
  MCG_C6 &= ~(1U << MCG_C6_PLLS_SHIFT);
  (void)MCG_C6_LOLIE0_MASK;
  (void)MCG_C6_LOLIE0_SHIFT;
  MCG_C6 |= MCG_C6_LOLIE0_MASK;
  MCG_C6 &= ~(1U << MCG_C6_LOLIE0_SHIFT);
  MCG_S_REG(MCG_BASE_PTR) = MCG_S_REG(MCG_BASE_PTR) + 1;
  (void)MCG_S_IRCST_MASK;
  (void)MCG_S_IRCST_SHIFT;
  MCG_S |= MCG_S_IRCST_MASK;
  MCG_S &= ~(1U << MCG_S_IRCST_SHIFT);
  (void)MCG_S_OSCINIT0_MASK;
  (void)MCG_S_OSCINIT0_SHIFT;
  MCG_S |= MCG_S_OSCINIT0_MASK;
  MCG_S &= ~(1U << MCG_S_OSCINIT0_SHIFT);
  (void)MCG_S_CLKST_MASK;
  (void)MCG_S_CLKST_SHIFT;
  (void)MCG_S_CLKST(1);
  MCG_S |= MCG_S_CLKST_MASK;
  MCG_S &= ~(1U << MCG_S_CLKST_SHIFT);
  (void)MCG_S_IREFST_MASK;
  (void)MCG_S_IREFST_SHIFT;
  MCG_S |= MCG_S_IREFST_MASK;
  MCG_S &= ~(1U << MCG_S_IREFST_SHIFT);
  (void)MCG_S_PLLST_MASK;
  (void)MCG_S_PLLST_SHIFT;
  MCG_S |= MCG_S_PLLST_MASK;
  MCG_S &= ~(1U << MCG_S_PLLST_SHIFT);
  (void)MCG_S_LOCK0_MASK;
  (void)MCG_S_LOCK0_SHIFT;
  MCG_S |= MCG_S_LOCK0_MASK;
  MCG_S &= ~(1U << MCG_S_LOCK0_SHIFT);
  (void)MCG_S_LOLS0_MASK;
  (void)MCG_S_LOLS0_SHIFT;
  MCG_S |= MCG_S_LOLS0_MASK;
  MCG_S &= ~(1U << MCG_S_LOLS0_SHIFT);
  MCG_SC_REG(MCG_BASE_PTR) = MCG_SC_REG(MCG_BASE_PTR) + 1;
  (void)MCG_SC_LOCS0_MASK;
  (void)MCG_SC_LOCS0_SHIFT;
  MCG_SC |= MCG_SC_LOCS0_MASK;
  MCG_SC &= ~(1U << MCG_SC_LOCS0_SHIFT);
  (void)MCG_SC_FCRDIV_MASK;
  (void)MCG_SC_FCRDIV_SHIFT;
  (void)MCG_SC_FCRDIV(1);
  MCG_SC |= MCG_SC_FCRDIV_MASK;
  MCG_SC &= ~(1U << MCG_SC_FCRDIV_SHIFT);
  (void)MCG_SC_FLTPRSRV_MASK;
  (void)MCG_SC_FLTPRSRV_SHIFT;
  MCG_SC |= MCG_SC_FLTPRSRV_MASK;
  MCG_SC &= ~(1U << MCG_SC_FLTPRSRV_SHIFT);
  (void)MCG_SC_ATMF_MASK;
  (void)MCG_SC_ATMF_SHIFT;
  MCG_SC |= MCG_SC_ATMF_MASK;
  MCG_SC &= ~(1U << MCG_SC_ATMF_SHIFT);
  (void)MCG_SC_ATMS_MASK;
  (void)MCG_SC_ATMS_SHIFT;
  MCG_SC |= MCG_SC_ATMS_MASK;
  MCG_SC &= ~(1U << MCG_SC_ATMS_SHIFT);
  (void)MCG_SC_ATME_MASK;
  (void)MCG_SC_ATME_SHIFT;
  MCG_SC |= MCG_SC_ATME_MASK;
  MCG_SC &= ~(1U << MCG_SC_ATME_SHIFT);
  MCG_ATCVH_REG(MCG_BASE_PTR) = MCG_ATCVH_REG(MCG_BASE_PTR) + 1;
  (void)MCG_ATCVH_ATCVH_MASK;
  (void)MCG_ATCVH_ATCVH_SHIFT;
  (void)MCG_ATCVH_ATCVH(1);
  MCG_ATCVH |= MCG_ATCVH_ATCVH_MASK;
  MCG_ATCVH &= ~(1U << MCG_ATCVH_ATCVH_SHIFT);
  MCG_ATCVL_REG(MCG_BASE_PTR) = MCG_ATCVL_REG(MCG_BASE_PTR) + 1;
  (void)MCG_ATCVL_ATCVL_MASK;
  (void)MCG_ATCVL_ATCVL_SHIFT;
  (void)MCG_ATCVL_ATCVL(1);
  MCG_ATCVL |= MCG_ATCVL_ATCVL_MASK;
  MCG_ATCVL &= ~(1U << MCG_ATCVL_ATCVL_SHIFT);
  MCG_C7_REG(MCG_BASE_PTR) = MCG_C7_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C7_OSCSEL_MASK;
  (void)MCG_C7_OSCSEL_SHIFT;
  MCG_C7 |= MCG_C7_OSCSEL_MASK;
  MCG_C7 &= ~(1U << MCG_C7_OSCSEL_SHIFT);
  (void)MCG_C7_PLL32KREFSEL_MASK;
  (void)MCG_C7_PLL32KREFSEL_SHIFT;
  (void)MCG_C7_PLL32KREFSEL(1);
  MCG_C7 |= MCG_C7_PLL32KREFSEL_MASK;
  MCG_C7 &= ~(1U << MCG_C7_PLL32KREFSEL_SHIFT);
  MCG_C8_REG(MCG_BASE_PTR) = MCG_C8_REG(MCG_BASE_PTR) + 1;
  (void)MCG_C8_LOCS1_MASK;
  (void)MCG_C8_LOCS1_SHIFT;
  MCG_C8 |= MCG_C8_LOCS1_MASK;
  MCG_C8 &= ~(1U << MCG_C8_LOCS1_SHIFT);
  (void)MCG_C8_COARSE_LOLIE_MASK;
  (void)MCG_C8_COARSE_LOLIE_SHIFT;
  MCG_C8 |= MCG_C8_COARSE_LOLIE_MASK;
  MCG_C8 &= ~(1U << MCG_C8_COARSE_LOLIE_SHIFT);
  (void)MCG_C8_CME1_MASK;
  (void)MCG_C8_CME1_SHIFT;
  MCG_C8 |= MCG_C8_CME1_MASK;
  MCG_C8 &= ~(1U << MCG_C8_CME1_SHIFT);
  (void)MCG_C8_LOLRE_MASK;
  (void)MCG_C8_LOLRE_SHIFT;
  MCG_C8 |= MCG_C8_LOLRE_MASK;
  MCG_C8 &= ~(1U << MCG_C8_LOLRE_SHIFT);
  (void)MCG_C8_LOCRE1_MASK;
  (void)MCG_C8_LOCRE1_SHIFT;
  MCG_C8 |= MCG_C8_LOCRE1_MASK;
  MCG_C8 &= ~(1U << MCG_C8_LOCRE1_SHIFT);
  (void)MCG_C9_COARSE_LOCK_MASK;
  (void)MCG_C9_COARSE_LOCK_SHIFT;
  MCG_C9 |= MCG_C9_COARSE_LOCK_MASK;
  MCG_C9 &= ~(1U << MCG_C9_COARSE_LOCK_SHIFT);
  (void)MCG_C9_COARSE_LOLS_MASK;
  (void)MCG_C9_COARSE_LOLS_SHIFT;
  MCG_C9 |= MCG_C9_COARSE_LOLS_MASK;
  MCG_C9 &= ~(1U << MCG_C9_COARSE_LOLS_SHIFT);
}

void test_MCM(void) {
  (void)MCM_BASE_PTR;
  MCM_PLACR = MCM_PLACR + 1;
  MCM_PID = MCM_PID + 1;
  MCM_CPO = MCM_CPO + 1;
  MCM_MATCR0 = MCM_MATCR0 + 1;
  (void)MCM_PLASC_ASC_MASK;
  (void)MCM_PLASC_ASC_SHIFT;
  (void)MCM_PLASC_ASC(1);
  MCM_PLASC |= MCM_PLASC_ASC_MASK;
  MCM_PLASC &= ~(1U << MCM_PLASC_ASC_SHIFT);
  (void)MCM_PLAMC_AMC_MASK;
  (void)MCM_PLAMC_AMC_SHIFT;
  (void)MCM_PLAMC_AMC(1);
  MCM_PLAMC |= MCM_PLAMC_AMC_MASK;
  MCM_PLAMC &= ~(1U << MCM_PLAMC_AMC_SHIFT);
  MCM_PLACR_REG(MCM_BASE_PTR) = MCM_PLACR_REG(MCM_BASE_PTR) + 1;
  (void)MCM_PLACR_ARB_MASK;
  (void)MCM_PLACR_ARB_SHIFT;
  MCM_PLACR |= MCM_PLACR_ARB_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_ARB_SHIFT);
  (void)MCM_PLACR_CFCC_MASK;
  (void)MCM_PLACR_CFCC_SHIFT;
  MCM_PLACR |= MCM_PLACR_CFCC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_CFCC_SHIFT);
  (void)MCM_PLACR_DFCDA_MASK;
  (void)MCM_PLACR_DFCDA_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCDA_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCDA_SHIFT);
  (void)MCM_PLACR_DFCIC_MASK;
  (void)MCM_PLACR_DFCIC_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCIC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCIC_SHIFT);
  (void)MCM_PLACR_DFCC_MASK;
  (void)MCM_PLACR_DFCC_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCC_SHIFT);
  (void)MCM_PLACR_EFDS_MASK;
  (void)MCM_PLACR_EFDS_SHIFT;
  MCM_PLACR |= MCM_PLACR_EFDS_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_EFDS_SHIFT);
  (void)MCM_PLACR_DFCS_MASK;
  (void)MCM_PLACR_DFCS_SHIFT;
  MCM_PLACR |= MCM_PLACR_DFCS_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_DFCS_SHIFT);
  (void)MCM_PLACR_ESFC_MASK;
  (void)MCM_PLACR_ESFC_SHIFT;
  MCM_PLACR |= MCM_PLACR_ESFC_MASK;
  MCM_PLACR &= ~(1U << MCM_PLACR_ESFC_SHIFT);
  MCM_PID_REG(MCM_BASE_PTR) = MCM_PID_REG(MCM_BASE_PTR) + 1;
  (void)MCM_PID_PID_MASK;
  (void)MCM_PID_PID_SHIFT;
  (void)MCM_PID_PID(1);
  MCM_PID |= MCM_PID_PID_MASK;
  MCM_PID &= ~(1U << MCM_PID_PID_SHIFT);
  MCM_CPO_REG(MCM_BASE_PTR) = MCM_CPO_REG(MCM_BASE_PTR) + 1;
  (void)MCM_CPO_CPOREQ_MASK;
  (void)MCM_CPO_CPOREQ_SHIFT;
  MCM_CPO |= MCM_CPO_CPOREQ_MASK;
  MCM_CPO &= ~(1U << MCM_CPO_CPOREQ_SHIFT);
  (void)MCM_CPO_CPOACK_MASK;
  (void)MCM_CPO_CPOACK_SHIFT;
  MCM_CPO |= MCM_CPO_CPOACK_MASK;
  MCM_CPO &= ~(1U << MCM_CPO_CPOACK_SHIFT);
  (void)MCM_CPO_CPOWOI_MASK;
  (void)MCM_CPO_CPOWOI_SHIFT;
  MCM_CPO |= MCM_CPO_CPOWOI_MASK;
  MCM_CPO &= ~(1U << MCM_CPO_CPOWOI_SHIFT);
  MCM_MATCR_REG(MCM_BASE_PTR,0) = MCM_MATCR_REG(MCM_BASE_PTR,0) + 1;
  MCM_MATCR(0) = MCM_MATCR(0) + 1;
  (void)MCM_MATCR_ATC0_MASK;
  (void)MCM_MATCR_ATC0_SHIFT;
  (void)MCM_MATCR_ATC0(1);
  MCM_MATCR0 |= MCM_MATCR_ATC0_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_ATC0_SHIFT);
  (void)MCM_MATCR_RO0_MASK;
  (void)MCM_MATCR_RO0_SHIFT;
  MCM_MATCR0 |= MCM_MATCR_RO0_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_RO0_SHIFT);
  (void)MCM_MATCR_ATC2_MASK;
  (void)MCM_MATCR_ATC2_SHIFT;
  (void)MCM_MATCR_ATC2(1);
  MCM_MATCR0 |= MCM_MATCR_ATC2_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_ATC2_SHIFT);
  (void)MCM_MATCR_RO2_MASK;
  (void)MCM_MATCR_RO2_SHIFT;
  MCM_MATCR0 |= MCM_MATCR_RO2_MASK;
  MCM_MATCR0 &= ~(1U << MCM_MATCR_RO2_SHIFT);
}

