kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM34Z5_v1_5.c
void test_NV(void) {
  (void)FTFA_FlashConfig_BASE_PTR;
  (void)NV_BACKKEY3_KEY_MASK;
  (void)NV_BACKKEY3_KEY_SHIFT;
  (void)NV_BACKKEY3_KEY(1);
  NV_BACKKEY3 |= NV_BACKKEY3_KEY_MASK;
  NV_BACKKEY3 &= ~(1U << NV_BACKKEY3_KEY_SHIFT);
  (void)NV_BACKKEY2_KEY_MASK;
  (void)NV_BACKKEY2_KEY_SHIFT;
  (void)NV_BACKKEY2_KEY(1);
  NV_BACKKEY2 |= NV_BACKKEY2_KEY_MASK;
  NV_BACKKEY2 &= ~(1U << NV_BACKKEY2_KEY_SHIFT);
  (void)NV_BACKKEY1_KEY_MASK;
  (void)NV_BACKKEY1_KEY_SHIFT;
  (void)NV_BACKKEY1_KEY(1);
  NV_BACKKEY1 |= NV_BACKKEY1_KEY_MASK;
  NV_BACKKEY1 &= ~(1U << NV_BACKKEY1_KEY_SHIFT);
  (void)NV_BACKKEY0_KEY_MASK;
  (void)NV_BACKKEY0_KEY_SHIFT;
  (void)NV_BACKKEY0_KEY(1);
  NV_BACKKEY0 |= NV_BACKKEY0_KEY_MASK;
  NV_BACKKEY0 &= ~(1U << NV_BACKKEY0_KEY_SHIFT);
  (void)NV_BACKKEY7_KEY_MASK;
  (void)NV_BACKKEY7_KEY_SHIFT;
  (void)NV_BACKKEY7_KEY(1);
  NV_BACKKEY7 |= NV_BACKKEY7_KEY_MASK;
  NV_BACKKEY7 &= ~(1U << NV_BACKKEY7_KEY_SHIFT);
  (void)NV_BACKKEY6_KEY_MASK;
  (void)NV_BACKKEY6_KEY_SHIFT;
  (void)NV_BACKKEY6_KEY(1);
  NV_BACKKEY6 |= NV_BACKKEY6_KEY_MASK;
  NV_BACKKEY6 &= ~(1U << NV_BACKKEY6_KEY_SHIFT);
  (void)NV_BACKKEY5_KEY_MASK;
  (void)NV_BACKKEY5_KEY_SHIFT;
  (void)NV_BACKKEY5_KEY(1);
  NV_BACKKEY5 |= NV_BACKKEY5_KEY_MASK;
  NV_BACKKEY5 &= ~(1U << NV_BACKKEY5_KEY_SHIFT);
  (void)NV_BACKKEY4_KEY_MASK;
  (void)NV_BACKKEY4_KEY_SHIFT;
  (void)NV_BACKKEY4_KEY(1);
  NV_BACKKEY4 |= NV_BACKKEY4_KEY_MASK;
  NV_BACKKEY4 &= ~(1U << NV_BACKKEY4_KEY_SHIFT);
  (void)NV_FPROT3_PROT_MASK;
  (void)NV_FPROT3_PROT_SHIFT;
  (void)NV_FPROT3_PROT(1);
  NV_FPROT3 |= NV_FPROT3_PROT_MASK;
  NV_FPROT3 &= ~(1U << NV_FPROT3_PROT_SHIFT);
  (void)NV_FPROT2_PROT_MASK;
  (void)NV_FPROT2_PROT_SHIFT;
  (void)NV_FPROT2_PROT(1);
  NV_FPROT2 |= NV_FPROT2_PROT_MASK;
  NV_FPROT2 &= ~(1U << NV_FPROT2_PROT_SHIFT);
  (void)NV_FPROT1_PROT_MASK;
  (void)NV_FPROT1_PROT_SHIFT;
  (void)NV_FPROT1_PROT(1);
  NV_FPROT1 |= NV_FPROT1_PROT_MASK;
  NV_FPROT1 &= ~(1U << NV_FPROT1_PROT_SHIFT);
  (void)NV_FPROT0_PROT_MASK;
  (void)NV_FPROT0_PROT_SHIFT;
  (void)NV_FPROT0_PROT(1);
  NV_FPROT0 |= NV_FPROT0_PROT_MASK;
  NV_FPROT0 &= ~(1U << NV_FPROT0_PROT_SHIFT);
  (void)NV_FSEC_SEC_MASK;
  (void)NV_FSEC_SEC_SHIFT;
  (void)NV_FSEC_SEC(1);
  NV_FSEC |= NV_FSEC_SEC_MASK;
  NV_FSEC &= ~(1U << NV_FSEC_SEC_SHIFT);
  (void)NV_FSEC_FSLACC_MASK;
  (void)NV_FSEC_FSLACC_SHIFT;
  (void)NV_FSEC_FSLACC(1);
  NV_FSEC |= NV_FSEC_FSLACC_MASK;
  NV_FSEC &= ~(1U << NV_FSEC_FSLACC_SHIFT);
  (void)NV_FSEC_MEEN_MASK;
  (void)NV_FSEC_MEEN_SHIFT;
  (void)NV_FSEC_MEEN(1);
  NV_FSEC |= NV_FSEC_MEEN_MASK;
  NV_FSEC &= ~(1U << NV_FSEC_MEEN_SHIFT);
  (void)NV_FSEC_KEYEN_MASK;
  (void)NV_FSEC_KEYEN_SHIFT;
  (void)NV_FSEC_KEYEN(1);
  NV_FSEC |= NV_FSEC_KEYEN_MASK;
  NV_FSEC &= ~(1U << NV_FSEC_KEYEN_SHIFT);
  (void)NV_FOPT_LPBOOT_MASK;
  (void)NV_FOPT_LPBOOT_SHIFT;
  NV_FOPT |= NV_FOPT_LPBOOT_MASK;
  NV_FOPT &= ~(1U << NV_FOPT_LPBOOT_SHIFT);
  (void)NV_FOPT_NMI_EN_MASK;
  (void)NV_FOPT_NMI_EN_SHIFT;
  NV_FOPT |= NV_FOPT_NMI_EN_MASK;
  NV_FOPT &= ~(1U << NV_FOPT_NMI_EN_SHIFT);
  (void)NV_FOPT_EXE_MODE_MASK;
  (void)NV_FOPT_EXE_MODE_SHIFT;
  NV_FOPT |= NV_FOPT_EXE_MODE_MASK;
  NV_FOPT &= ~(1U << NV_FOPT_EXE_MODE_SHIFT);
  (void)NV_FOPT_CLK_SRC_MASK;
  (void)NV_FOPT_CLK_SRC_SHIFT;
  NV_FOPT |= NV_FOPT_CLK_SRC_MASK;
  NV_FOPT &= ~(1U << NV_FOPT_CLK_SRC_SHIFT);
}

void test_NVIC(void) {
  (void)NVIC_BASE_PTR;
  NVIC_ISER = NVIC_ISER + 1;
  NVIC_ICER = NVIC_ICER + 1;
  NVIC_ISPR = NVIC_ISPR + 1;
  NVIC_ICPR = NVIC_ICPR + 1;
  NVIC_IPR0 = NVIC_IPR0 + 1;
  NVIC_IPR1 = NVIC_IPR1 + 1;
  NVIC_IPR2 = NVIC_IPR2 + 1;
  NVIC_IPR3 = NVIC_IPR3 + 1;
  NVIC_IPR4 = NVIC_IPR4 + 1;
  NVIC_IPR5 = NVIC_IPR5 + 1;
  NVIC_IPR6 = NVIC_IPR6 + 1;
  NVIC_IPR7 = NVIC_IPR7 + 1;
  NVIC_ISER_REG(NVIC_BASE_PTR) = NVIC_ISER_REG(NVIC_BASE_PTR) + 1;
  (void)NVIC_ISER_SETENA0_MASK;
  (void)NVIC_ISER_SETENA0_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA0_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA0_SHIFT);
  (void)NVIC_ISER_SETENA1_MASK;
  (void)NVIC_ISER_SETENA1_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA1_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA1_SHIFT);
  (void)NVIC_ISER_SETENA2_MASK;
  (void)NVIC_ISER_SETENA2_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA2_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA2_SHIFT);
  (void)NVIC_ISER_SETENA3_MASK;
  (void)NVIC_ISER_SETENA3_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA3_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA3_SHIFT);
  (void)NVIC_ISER_SETENA4_MASK;
  (void)NVIC_ISER_SETENA4_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA4_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA4_SHIFT);
  (void)NVIC_ISER_SETENA5_MASK;
  (void)NVIC_ISER_SETENA5_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA5_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA5_SHIFT);
  (void)NVIC_ISER_SETENA6_MASK;
  (void)NVIC_ISER_SETENA6_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA6_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA6_SHIFT);
  (void)NVIC_ISER_SETENA7_MASK;
  (void)NVIC_ISER_SETENA7_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA7_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA7_SHIFT);
  (void)NVIC_ISER_SETENA8_MASK;
  (void)NVIC_ISER_SETENA8_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA8_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA8_SHIFT);
  (void)NVIC_ISER_SETENA9_MASK;
  (void)NVIC_ISER_SETENA9_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA9_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA9_SHIFT);
  (void)NVIC_ISER_SETENA10_MASK;
  (void)NVIC_ISER_SETENA10_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA10_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA10_SHIFT);
  (void)NVIC_ISER_SETENA11_MASK;
  (void)NVIC_ISER_SETENA11_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA11_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA11_SHIFT);
  (void)NVIC_ISER_SETENA12_MASK;
  (void)NVIC_ISER_SETENA12_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA12_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA12_SHIFT);
  (void)NVIC_ISER_SETENA13_MASK;
  (void)NVIC_ISER_SETENA13_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA13_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA13_SHIFT);
  (void)NVIC_ISER_SETENA14_MASK;
  (void)NVIC_ISER_SETENA14_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA14_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA14_SHIFT);
  (void)NVIC_ISER_SETENA15_MASK;
  (void)NVIC_ISER_SETENA15_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA15_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA15_SHIFT);
  (void)NVIC_ISER_SETENA16_MASK;
  (void)NVIC_ISER_SETENA16_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA16_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA16_SHIFT);
  (void)NVIC_ISER_SETENA17_MASK;
  (void)NVIC_ISER_SETENA17_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA17_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA17_SHIFT);
  (void)NVIC_ISER_SETENA18_MASK;
  (void)NVIC_ISER_SETENA18_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA18_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA18_SHIFT);
  (void)NVIC_ISER_SETENA19_MASK;
  (void)NVIC_ISER_SETENA19_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA19_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA19_SHIFT);
  (void)NVIC_ISER_SETENA20_MASK;
  (void)NVIC_ISER_SETENA20_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA20_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA20_SHIFT);
  (void)NVIC_ISER_SETENA21_MASK;
  (void)NVIC_ISER_SETENA21_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA21_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA21_SHIFT);
  (void)NVIC_ISER_SETENA22_MASK;
  (void)NVIC_ISER_SETENA22_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA22_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA22_SHIFT);
  (void)NVIC_ISER_SETENA23_MASK;
  (void)NVIC_ISER_SETENA23_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA23_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA23_SHIFT);
  (void)NVIC_ISER_SETENA24_MASK;
  (void)NVIC_ISER_SETENA24_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA24_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA24_SHIFT);
  (void)NVIC_ISER_SETENA25_MASK;
  (void)NVIC_ISER_SETENA25_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA25_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA25_SHIFT);
  (void)NVIC_ISER_SETENA26_MASK;
  (void)NVIC_ISER_SETENA26_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA26_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA26_SHIFT);
  (void)NVIC_ISER_SETENA27_MASK;
  (void)NVIC_ISER_SETENA27_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA27_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA27_SHIFT);
  (void)NVIC_ISER_SETENA28_MASK;
  (void)NVIC_ISER_SETENA28_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA28_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA28_SHIFT);
  (void)NVIC_ISER_SETENA29_MASK;
  (void)NVIC_ISER_SETENA29_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA29_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA29_SHIFT);
  (void)NVIC_ISER_SETENA30_MASK;
  (void)NVIC_ISER_SETENA30_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA30_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA30_SHIFT);
  (void)NVIC_ISER_SETENA31_MASK;
  (void)NVIC_ISER_SETENA31_SHIFT;
  NVIC_ISER |= NVIC_ISER_SETENA31_MASK;
  NVIC_ISER &= ~(1U << NVIC_ISER_SETENA31_SHIFT);
  NVIC_ICER_REG(NVIC_BASE_PTR) = NVIC_ICER_REG(NVIC_BASE_PTR) + 1;
  (void)NVIC_ICER_CLRENA0_MASK;
  (void)NVIC_ICER_CLRENA0_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA0_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA0_SHIFT);
  (void)NVIC_ICER_CLRENA1_MASK;
  (void)NVIC_ICER_CLRENA1_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA1_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA1_SHIFT);
  (void)NVIC_ICER_CLRENA2_MASK;
  (void)NVIC_ICER_CLRENA2_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA2_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA2_SHIFT);
  (void)NVIC_ICER_CLRENA3_MASK;
  (void)NVIC_ICER_CLRENA3_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA3_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA3_SHIFT);
  (void)NVIC_ICER_CLRENA4_MASK;
  (void)NVIC_ICER_CLRENA4_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA4_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA4_SHIFT);
  (void)NVIC_ICER_CLRENA5_MASK;
  (void)NVIC_ICER_CLRENA5_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA5_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA5_SHIFT);
  (void)NVIC_ICER_CLRENA6_MASK;
  (void)NVIC_ICER_CLRENA6_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA6_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA6_SHIFT);
  (void)NVIC_ICER_CLRENA7_MASK;
  (void)NVIC_ICER_CLRENA7_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA7_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA7_SHIFT);
  (void)NVIC_ICER_CLRENA8_MASK;
  (void)NVIC_ICER_CLRENA8_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA8_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA8_SHIFT);
  (void)NVIC_ICER_CLRENA9_MASK;
  (void)NVIC_ICER_CLRENA9_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA9_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA9_SHIFT);
  (void)NVIC_ICER_CLRENA10_MASK;
  (void)NVIC_ICER_CLRENA10_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA10_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA10_SHIFT);
  (void)NVIC_ICER_CLRENA11_MASK;
  (void)NVIC_ICER_CLRENA11_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA11_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA11_SHIFT);
  (void)NVIC_ICER_CLRENA12_MASK;
  (void)NVIC_ICER_CLRENA12_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA12_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA12_SHIFT);
  (void)NVIC_ICER_CLRENA13_MASK;
  (void)NVIC_ICER_CLRENA13_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA13_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA13_SHIFT);
  (void)NVIC_ICER_CLRENA14_MASK;
  (void)NVIC_ICER_CLRENA14_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA14_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA14_SHIFT);
  (void)NVIC_ICER_CLRENA15_MASK;
  (void)NVIC_ICER_CLRENA15_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA15_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA15_SHIFT);
  (void)NVIC_ICER_CLRENA16_MASK;
  (void)NVIC_ICER_CLRENA16_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA16_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA16_SHIFT);
  (void)NVIC_ICER_CLRENA17_MASK;
  (void)NVIC_ICER_CLRENA17_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA17_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA17_SHIFT);
  (void)NVIC_ICER_CLRENA18_MASK;
  (void)NVIC_ICER_CLRENA18_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA18_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA18_SHIFT);
  (void)NVIC_ICER_CLRENA19_MASK;
  (void)NVIC_ICER_CLRENA19_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA19_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA19_SHIFT);
  (void)NVIC_ICER_CLRENA20_MASK;
  (void)NVIC_ICER_CLRENA20_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA20_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA20_SHIFT);
  (void)NVIC_ICER_CLRENA21_MASK;
  (void)NVIC_ICER_CLRENA21_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA21_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA21_SHIFT);
  (void)NVIC_ICER_CLRENA22_MASK;
  (void)NVIC_ICER_CLRENA22_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA22_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA22_SHIFT);
  (void)NVIC_ICER_CLRENA23_MASK;
  (void)NVIC_ICER_CLRENA23_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA23_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA23_SHIFT);
  (void)NVIC_ICER_CLRENA24_MASK;
  (void)NVIC_ICER_CLRENA24_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA24_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA24_SHIFT);
  (void)NVIC_ICER_CLRENA25_MASK;
  (void)NVIC_ICER_CLRENA25_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA25_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA25_SHIFT);
  (void)NVIC_ICER_CLRENA26_MASK;
  (void)NVIC_ICER_CLRENA26_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA26_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA26_SHIFT);
  (void)NVIC_ICER_CLRENA27_MASK;
  (void)NVIC_ICER_CLRENA27_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA27_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA27_SHIFT);
  (void)NVIC_ICER_CLRENA28_MASK;
  (void)NVIC_ICER_CLRENA28_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA28_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA28_SHIFT);
  (void)NVIC_ICER_CLRENA29_MASK;
  (void)NVIC_ICER_CLRENA29_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA29_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA29_SHIFT);
  (void)NVIC_ICER_CLRENA30_MASK;
  (void)NVIC_ICER_CLRENA30_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA30_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA30_SHIFT);
  (void)NVIC_ICER_CLRENA31_MASK;
  (void)NVIC_ICER_CLRENA31_SHIFT;
  NVIC_ICER |= NVIC_ICER_CLRENA31_MASK;
  NVIC_ICER &= ~(1U << NVIC_ICER_CLRENA31_SHIFT);
  NVIC_ISPR_REG(NVIC_BASE_PTR) = NVIC_ISPR_REG(NVIC_BASE_PTR) + 1;
  (void)NVIC_ISPR_SETPEND0_MASK;
  (void)NVIC_ISPR_SETPEND0_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND0_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND0_SHIFT);
  (void)NVIC_ISPR_SETPEND1_MASK;
  (void)NVIC_ISPR_SETPEND1_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND1_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND1_SHIFT);
  (void)NVIC_ISPR_SETPEND2_MASK;
  (void)NVIC_ISPR_SETPEND2_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND2_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND2_SHIFT);
  (void)NVIC_ISPR_SETPEND3_MASK;
  (void)NVIC_ISPR_SETPEND3_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND3_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND3_SHIFT);
  (void)NVIC_ISPR_SETPEND4_MASK;
  (void)NVIC_ISPR_SETPEND4_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND4_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND4_SHIFT);
  (void)NVIC_ISPR_SETPEND5_MASK;
  (void)NVIC_ISPR_SETPEND5_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND5_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND5_SHIFT);
  (void)NVIC_ISPR_SETPEND6_MASK;
  (void)NVIC_ISPR_SETPEND6_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND6_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND6_SHIFT);
  (void)NVIC_ISPR_SETPEND7_MASK;
  (void)NVIC_ISPR_SETPEND7_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND7_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND7_SHIFT);
  (void)NVIC_ISPR_SETPEND8_MASK;
  (void)NVIC_ISPR_SETPEND8_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND8_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND8_SHIFT);
  (void)NVIC_ISPR_SETPEND9_MASK;
  (void)NVIC_ISPR_SETPEND9_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND9_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND9_SHIFT);
  (void)NVIC_ISPR_SETPEND10_MASK;
  (void)NVIC_ISPR_SETPEND10_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND10_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND10_SHIFT);
  (void)NVIC_ISPR_SETPEND11_MASK;
  (void)NVIC_ISPR_SETPEND11_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND11_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND11_SHIFT);
  (void)NVIC_ISPR_SETPEND12_MASK;
  (void)NVIC_ISPR_SETPEND12_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND12_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND12_SHIFT);
  (void)NVIC_ISPR_SETPEND13_MASK;
  (void)NVIC_ISPR_SETPEND13_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND13_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND13_SHIFT);
  (void)NVIC_ISPR_SETPEND14_MASK;
  (void)NVIC_ISPR_SETPEND14_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND14_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND14_SHIFT);
  (void)NVIC_ISPR_SETPEND15_MASK;
  (void)NVIC_ISPR_SETPEND15_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND15_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND15_SHIFT);
  (void)NVIC_ISPR_SETPEND16_MASK;
  (void)NVIC_ISPR_SETPEND16_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND16_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND16_SHIFT);
  (void)NVIC_ISPR_SETPEND17_MASK;
  (void)NVIC_ISPR_SETPEND17_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND17_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND17_SHIFT);
  (void)NVIC_ISPR_SETPEND18_MASK;
  (void)NVIC_ISPR_SETPEND18_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND18_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND18_SHIFT);
  (void)NVIC_ISPR_SETPEND19_MASK;
  (void)NVIC_ISPR_SETPEND19_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND19_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND19_SHIFT);
  (void)NVIC_ISPR_SETPEND20_MASK;
  (void)NVIC_ISPR_SETPEND20_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND20_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND20_SHIFT);
  (void)NVIC_ISPR_SETPEND21_MASK;
  (void)NVIC_ISPR_SETPEND21_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND21_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND21_SHIFT);
  (void)NVIC_ISPR_SETPEND22_MASK;
  (void)NVIC_ISPR_SETPEND22_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND22_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND22_SHIFT);
  (void)NVIC_ISPR_SETPEND23_MASK;
  (void)NVIC_ISPR_SETPEND23_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND23_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND23_SHIFT);
  (void)NVIC_ISPR_SETPEND24_MASK;
  (void)NVIC_ISPR_SETPEND24_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND24_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND24_SHIFT);
  (void)NVIC_ISPR_SETPEND25_MASK;
  (void)NVIC_ISPR_SETPEND25_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND25_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND25_SHIFT);
  (void)NVIC_ISPR_SETPEND26_MASK;
  (void)NVIC_ISPR_SETPEND26_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND26_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND26_SHIFT);
  (void)NVIC_ISPR_SETPEND27_MASK;
  (void)NVIC_ISPR_SETPEND27_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND27_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND27_SHIFT);
  (void)NVIC_ISPR_SETPEND28_MASK;
  (void)NVIC_ISPR_SETPEND28_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND28_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND28_SHIFT);
  (void)NVIC_ISPR_SETPEND29_MASK;
  (void)NVIC_ISPR_SETPEND29_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND29_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND29_SHIFT);
  (void)NVIC_ISPR_SETPEND30_MASK;
  (void)NVIC_ISPR_SETPEND30_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND30_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND30_SHIFT);
  (void)NVIC_ISPR_SETPEND31_MASK;
  (void)NVIC_ISPR_SETPEND31_SHIFT;
  NVIC_ISPR |= NVIC_ISPR_SETPEND31_MASK;
  NVIC_ISPR &= ~(1U << NVIC_ISPR_SETPEND31_SHIFT);
  NVIC_ICPR_REG(NVIC_BASE_PTR) = NVIC_ICPR_REG(NVIC_BASE_PTR) + 1;
  (void)NVIC_ICPR_CLRPEND0_MASK;
  (void)NVIC_ICPR_CLRPEND0_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND0_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND0_SHIFT);
  (void)NVIC_ICPR_CLRPEND1_MASK;
  (void)NVIC_ICPR_CLRPEND1_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND1_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND1_SHIFT);
  (void)NVIC_ICPR_CLRPEND2_MASK;
  (void)NVIC_ICPR_CLRPEND2_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND2_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND2_SHIFT);
  (void)NVIC_ICPR_CLRPEND3_MASK;
  (void)NVIC_ICPR_CLRPEND3_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND3_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND3_SHIFT);
  (void)NVIC_ICPR_CLRPEND4_MASK;
  (void)NVIC_ICPR_CLRPEND4_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND4_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND4_SHIFT);
  (void)NVIC_ICPR_CLRPEND5_MASK;
  (void)NVIC_ICPR_CLRPEND5_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND5_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND5_SHIFT);
  (void)NVIC_ICPR_CLRPEND6_MASK;
  (void)NVIC_ICPR_CLRPEND6_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND6_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND6_SHIFT);
  (void)NVIC_ICPR_CLRPEND7_MASK;
  (void)NVIC_ICPR_CLRPEND7_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND7_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND7_SHIFT);
  (void)NVIC_ICPR_CLRPEND8_MASK;
  (void)NVIC_ICPR_CLRPEND8_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND8_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND8_SHIFT);
  (void)NVIC_ICPR_CLRPEND9_MASK;
  (void)NVIC_ICPR_CLRPEND9_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND9_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND9_SHIFT);
  (void)NVIC_ICPR_CLRPEND10_MASK;
  (void)NVIC_ICPR_CLRPEND10_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND10_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND10_SHIFT);
  (void)NVIC_ICPR_CLRPEND11_MASK;
  (void)NVIC_ICPR_CLRPEND11_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND11_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND11_SHIFT);
  (void)NVIC_ICPR_CLRPEND12_MASK;
  (void)NVIC_ICPR_CLRPEND12_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND12_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND12_SHIFT);
  (void)NVIC_ICPR_CLRPEND13_MASK;
  (void)NVIC_ICPR_CLRPEND13_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND13_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND13_SHIFT);
  (void)NVIC_ICPR_CLRPEND14_MASK;
  (void)NVIC_ICPR_CLRPEND14_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND14_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND14_SHIFT);
  (void)NVIC_ICPR_CLRPEND15_MASK;
  (void)NVIC_ICPR_CLRPEND15_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND15_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND15_SHIFT);
  (void)NVIC_ICPR_CLRPEND16_MASK;
  (void)NVIC_ICPR_CLRPEND16_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND16_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND16_SHIFT);
  (void)NVIC_ICPR_CLRPEND17_MASK;
  (void)NVIC_ICPR_CLRPEND17_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND17_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND17_SHIFT);
  (void)NVIC_ICPR_CLRPEND18_MASK;
  (void)NVIC_ICPR_CLRPEND18_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND18_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND18_SHIFT);
  (void)NVIC_ICPR_CLRPEND19_MASK;
  (void)NVIC_ICPR_CLRPEND19_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND19_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND19_SHIFT);
  (void)NVIC_ICPR_CLRPEND20_MASK;
  (void)NVIC_ICPR_CLRPEND20_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND20_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND20_SHIFT);
  (void)NVIC_ICPR_CLRPEND21_MASK;
  (void)NVIC_ICPR_CLRPEND21_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND21_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND21_SHIFT);
  (void)NVIC_ICPR_CLRPEND22_MASK;
  (void)NVIC_ICPR_CLRPEND22_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND22_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND22_SHIFT);
  (void)NVIC_ICPR_CLRPEND23_MASK;
  (void)NVIC_ICPR_CLRPEND23_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND23_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND23_SHIFT);
  (void)NVIC_ICPR_CLRPEND24_MASK;
  (void)NVIC_ICPR_CLRPEND24_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND24_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND24_SHIFT);
  (void)NVIC_ICPR_CLRPEND25_MASK;
  (void)NVIC_ICPR_CLRPEND25_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND25_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND25_SHIFT);
  (void)NVIC_ICPR_CLRPEND26_MASK;
  (void)NVIC_ICPR_CLRPEND26_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND26_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND26_SHIFT);
  (void)NVIC_ICPR_CLRPEND27_MASK;
  (void)NVIC_ICPR_CLRPEND27_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND27_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND27_SHIFT);
  (void)NVIC_ICPR_CLRPEND28_MASK;
  (void)NVIC_ICPR_CLRPEND28_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND28_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND28_SHIFT);
  (void)NVIC_ICPR_CLRPEND29_MASK;
  (void)NVIC_ICPR_CLRPEND29_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND29_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND29_SHIFT);
  (void)NVIC_ICPR_CLRPEND30_MASK;
  (void)NVIC_ICPR_CLRPEND30_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND30_MASK;
