kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM34Z5_v1_5.c
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND30_SHIFT);
  (void)NVIC_ICPR_CLRPEND31_MASK;
  (void)NVIC_ICPR_CLRPEND31_SHIFT;
  NVIC_ICPR |= NVIC_ICPR_CLRPEND31_MASK;
  NVIC_ICPR &= ~(1U << NVIC_ICPR_CLRPEND31_SHIFT);
  NVIC_IP_REG(NVIC_BASE_PTR,0) = NVIC_IP_REG(NVIC_BASE_PTR,0) + 1;
  NVIC_IP(0) = NVIC_IP(0) + 1;
  (void)NVIC_IP_PRI_0_MASK;
  (void)NVIC_IP_PRI_0_SHIFT;
  (void)NVIC_IP_PRI_0(1);
  NVIC_IPR0 |= NVIC_IP_PRI_0_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_0_SHIFT);
  (void)NVIC_IP_PRI_28_MASK;
  (void)NVIC_IP_PRI_28_SHIFT;
  (void)NVIC_IP_PRI_28(1);
  NVIC_IPR0 |= NVIC_IP_PRI_28_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_28_SHIFT);
  (void)NVIC_IP_PRI_24_MASK;
  (void)NVIC_IP_PRI_24_SHIFT;
  (void)NVIC_IP_PRI_24(1);
  NVIC_IPR0 |= NVIC_IP_PRI_24_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_24_SHIFT);
  (void)NVIC_IP_PRI_20_MASK;
  (void)NVIC_IP_PRI_20_SHIFT;
  (void)NVIC_IP_PRI_20(1);
  NVIC_IPR0 |= NVIC_IP_PRI_20_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_20_SHIFT);
  (void)NVIC_IP_PRI_4_MASK;
  (void)NVIC_IP_PRI_4_SHIFT;
  (void)NVIC_IP_PRI_4(1);
  NVIC_IPR0 |= NVIC_IP_PRI_4_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_4_SHIFT);
  (void)NVIC_IP_PRI_16_MASK;
  (void)NVIC_IP_PRI_16_SHIFT;
  (void)NVIC_IP_PRI_16(1);
  NVIC_IPR0 |= NVIC_IP_PRI_16_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_16_SHIFT);
  (void)NVIC_IP_PRI_12_MASK;
  (void)NVIC_IP_PRI_12_SHIFT;
  (void)NVIC_IP_PRI_12(1);
  NVIC_IPR0 |= NVIC_IP_PRI_12_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_12_SHIFT);
  (void)NVIC_IP_PRI_8_MASK;
  (void)NVIC_IP_PRI_8_SHIFT;
  (void)NVIC_IP_PRI_8(1);
  NVIC_IPR0 |= NVIC_IP_PRI_8_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_8_SHIFT);
  (void)NVIC_IP_PRI_13_MASK;
  (void)NVIC_IP_PRI_13_SHIFT;
  (void)NVIC_IP_PRI_13(1);
  NVIC_IPR0 |= NVIC_IP_PRI_13_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_13_SHIFT);
  (void)NVIC_IP_PRI_21_MASK;
  (void)NVIC_IP_PRI_21_SHIFT;
  (void)NVIC_IP_PRI_21(1);
  NVIC_IPR0 |= NVIC_IP_PRI_21_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_21_SHIFT);
  (void)NVIC_IP_PRI_29_MASK;
  (void)NVIC_IP_PRI_29_SHIFT;
  (void)NVIC_IP_PRI_29(1);
  NVIC_IPR0 |= NVIC_IP_PRI_29_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_29_SHIFT);
  (void)NVIC_IP_PRI_1_MASK;
  (void)NVIC_IP_PRI_1_SHIFT;
  (void)NVIC_IP_PRI_1(1);
  NVIC_IPR0 |= NVIC_IP_PRI_1_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_1_SHIFT);
  (void)NVIC_IP_PRI_9_MASK;
  (void)NVIC_IP_PRI_9_SHIFT;
  (void)NVIC_IP_PRI_9(1);
  NVIC_IPR0 |= NVIC_IP_PRI_9_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_9_SHIFT);
  (void)NVIC_IP_PRI_17_MASK;
  (void)NVIC_IP_PRI_17_SHIFT;
  (void)NVIC_IP_PRI_17(1);
  NVIC_IPR0 |= NVIC_IP_PRI_17_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_17_SHIFT);
  (void)NVIC_IP_PRI_25_MASK;
  (void)NVIC_IP_PRI_25_SHIFT;
  (void)NVIC_IP_PRI_25(1);
  NVIC_IPR0 |= NVIC_IP_PRI_25_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_25_SHIFT);
  (void)NVIC_IP_PRI_5_MASK;
  (void)NVIC_IP_PRI_5_SHIFT;
  (void)NVIC_IP_PRI_5(1);
  NVIC_IPR0 |= NVIC_IP_PRI_5_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_5_SHIFT);
  (void)NVIC_IP_PRI_2_MASK;
  (void)NVIC_IP_PRI_2_SHIFT;
  (void)NVIC_IP_PRI_2(1);
  NVIC_IPR0 |= NVIC_IP_PRI_2_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_2_SHIFT);
  (void)NVIC_IP_PRI_26_MASK;
  (void)NVIC_IP_PRI_26_SHIFT;
  (void)NVIC_IP_PRI_26(1);
  NVIC_IPR0 |= NVIC_IP_PRI_26_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_26_SHIFT);
  (void)NVIC_IP_PRI_18_MASK;
  (void)NVIC_IP_PRI_18_SHIFT;
  (void)NVIC_IP_PRI_18(1);
  NVIC_IPR0 |= NVIC_IP_PRI_18_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_18_SHIFT);
  (void)NVIC_IP_PRI_14_MASK;
  (void)NVIC_IP_PRI_14_SHIFT;
  (void)NVIC_IP_PRI_14(1);
  NVIC_IPR0 |= NVIC_IP_PRI_14_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_14_SHIFT);
  (void)NVIC_IP_PRI_6_MASK;
  (void)NVIC_IP_PRI_6_SHIFT;
  (void)NVIC_IP_PRI_6(1);
  NVIC_IPR0 |= NVIC_IP_PRI_6_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_6_SHIFT);
  (void)NVIC_IP_PRI_30_MASK;
  (void)NVIC_IP_PRI_30_SHIFT;
  (void)NVIC_IP_PRI_30(1);
  NVIC_IPR0 |= NVIC_IP_PRI_30_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_30_SHIFT);
  (void)NVIC_IP_PRI_22_MASK;
  (void)NVIC_IP_PRI_22_SHIFT;
  (void)NVIC_IP_PRI_22(1);
  NVIC_IPR0 |= NVIC_IP_PRI_22_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_22_SHIFT);
  (void)NVIC_IP_PRI_10_MASK;
  (void)NVIC_IP_PRI_10_SHIFT;
  (void)NVIC_IP_PRI_10(1);
  NVIC_IPR0 |= NVIC_IP_PRI_10_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_10_SHIFT);
  (void)NVIC_IP_PRI_31_MASK;
  (void)NVIC_IP_PRI_31_SHIFT;
  (void)NVIC_IP_PRI_31(1);
  NVIC_IPR0 |= NVIC_IP_PRI_31_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_31_SHIFT);
  (void)NVIC_IP_PRI_27_MASK;
  (void)NVIC_IP_PRI_27_SHIFT;
  (void)NVIC_IP_PRI_27(1);
  NVIC_IPR0 |= NVIC_IP_PRI_27_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_27_SHIFT);
  (void)NVIC_IP_PRI_23_MASK;
  (void)NVIC_IP_PRI_23_SHIFT;
  (void)NVIC_IP_PRI_23(1);
  NVIC_IPR0 |= NVIC_IP_PRI_23_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_23_SHIFT);
  (void)NVIC_IP_PRI_3_MASK;
  (void)NVIC_IP_PRI_3_SHIFT;
  (void)NVIC_IP_PRI_3(1);
  NVIC_IPR0 |= NVIC_IP_PRI_3_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_3_SHIFT);
  (void)NVIC_IP_PRI_19_MASK;
  (void)NVIC_IP_PRI_19_SHIFT;
  (void)NVIC_IP_PRI_19(1);
  NVIC_IPR0 |= NVIC_IP_PRI_19_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_19_SHIFT);
  (void)NVIC_IP_PRI_15_MASK;
  (void)NVIC_IP_PRI_15_SHIFT;
  (void)NVIC_IP_PRI_15(1);
  NVIC_IPR0 |= NVIC_IP_PRI_15_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_15_SHIFT);
  (void)NVIC_IP_PRI_11_MASK;
  (void)NVIC_IP_PRI_11_SHIFT;
  (void)NVIC_IP_PRI_11(1);
  NVIC_IPR0 |= NVIC_IP_PRI_11_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_11_SHIFT);
  (void)NVIC_IP_PRI_7_MASK;
  (void)NVIC_IP_PRI_7_SHIFT;
  (void)NVIC_IP_PRI_7(1);
  NVIC_IPR0 |= NVIC_IP_PRI_7_MASK;
  NVIC_IPR0 &= ~(1U << NVIC_IP_PRI_7_SHIFT);
}

void test_OSC(void) {
  (void)OSC_BASE_PTR;
  OSC_CR = OSC_CR + 1;
  OSC_CR_REG(OSC_BASE_PTR) = OSC_CR_REG(OSC_BASE_PTR) + 1;
  (void)OSC_CR_SC16P_MASK;
  (void)OSC_CR_SC16P_SHIFT;
  OSC_CR |= OSC_CR_SC16P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC16P_SHIFT);
  (void)OSC_CR_SC8P_MASK;
  (void)OSC_CR_SC8P_SHIFT;
  OSC_CR |= OSC_CR_SC8P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC8P_SHIFT);
  (void)OSC_CR_SC4P_MASK;
  (void)OSC_CR_SC4P_SHIFT;
  OSC_CR |= OSC_CR_SC4P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC4P_SHIFT);
  (void)OSC_CR_SC2P_MASK;
  (void)OSC_CR_SC2P_SHIFT;
  OSC_CR |= OSC_CR_SC2P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC2P_SHIFT);
  (void)OSC_CR_EREFSTEN_MASK;
  (void)OSC_CR_EREFSTEN_SHIFT;
  OSC_CR |= OSC_CR_EREFSTEN_MASK;
  OSC_CR &= ~(1U << OSC_CR_EREFSTEN_SHIFT);
  (void)OSC_CR_ERCLKEN_MASK;
  (void)OSC_CR_ERCLKEN_SHIFT;
  OSC_CR |= OSC_CR_ERCLKEN_MASK;
  OSC_CR &= ~(1U << OSC_CR_ERCLKEN_SHIFT);
}

void test_PIT(void) {
  (void)PIT0_BASE_PTR;
  (void)PIT1_BASE_PTR;
  PIT0_MCR = PIT0_MCR + 1;
  PIT0_LDVAL0 = PIT0_LDVAL0 + 1;
  PIT0_TCTRL0 = PIT0_TCTRL0 + 1;
  PIT0_TFLG0 = PIT0_TFLG0 + 1;
  PIT0_LDVAL1 = PIT0_LDVAL1 + 1;
  PIT0_TCTRL1 = PIT0_TCTRL1 + 1;
  PIT0_TFLG1 = PIT0_TFLG1 + 1;
  PIT1_MCR = PIT1_MCR + 1;
  PIT1_LDVAL0 = PIT1_LDVAL0 + 1;
  PIT1_TCTRL0 = PIT1_TCTRL0 + 1;
  PIT1_TFLG0 = PIT1_TFLG0 + 1;
  PIT1_LDVAL1 = PIT1_LDVAL1 + 1;
  PIT1_TCTRL1 = PIT1_TCTRL1 + 1;
  PIT1_TFLG1 = PIT1_TFLG1 + 1;
  PIT_MCR_REG(PIT0_BASE_PTR) = PIT_MCR_REG(PIT0_BASE_PTR) + 1;
  PIT_MCR_REG(PIT1_BASE_PTR) = PIT_MCR_REG(PIT1_BASE_PTR) + 1;
  (void)PIT_MCR_FRZ_MASK;
  (void)PIT_MCR_FRZ_SHIFT;
  PIT0_MCR |= PIT_MCR_FRZ_MASK;
  PIT0_MCR &= ~(1U << PIT_MCR_FRZ_SHIFT);
  (void)PIT_MCR_MDIS_MASK;
  (void)PIT_MCR_MDIS_SHIFT;
  PIT0_MCR |= PIT_MCR_MDIS_MASK;
  PIT0_MCR &= ~(1U << PIT_MCR_MDIS_SHIFT);
  PIT_LDVAL_REG(PIT0_BASE_PTR,0) = PIT_LDVAL_REG(PIT0_BASE_PTR,0) + 1;
  PIT0_LDVAL(0) = PIT0_LDVAL(0) + 1;
  PIT1_LDVAL(0) = PIT1_LDVAL(0) + 1;
  PIT_LDVAL_REG(PIT1_BASE_PTR,0) = PIT_LDVAL_REG(PIT1_BASE_PTR,0) + 1;
  PIT0_LDVAL(0) = PIT0_LDVAL(0) + 1;
  PIT1_LDVAL(0) = PIT1_LDVAL(0) + 1;
  (void)PIT_LDVAL_TSV_MASK;
  (void)PIT_LDVAL_TSV_SHIFT;
  (void)PIT_LDVAL_TSV(1);
  PIT0_LDVAL0 |= PIT_LDVAL_TSV_MASK;
  PIT0_LDVAL0 &= ~(1U << PIT_LDVAL_TSV_SHIFT);
  (void)PIT_CVAL_TVL_MASK;
  (void)PIT_CVAL_TVL_SHIFT;
  (void)PIT_CVAL_TVL(1);
  PIT0_CVAL0 |= PIT_CVAL_TVL_MASK;
  PIT0_CVAL0 &= ~(1U << PIT_CVAL_TVL_SHIFT);
  PIT_TCTRL_REG(PIT0_BASE_PTR,0) = PIT_TCTRL_REG(PIT0_BASE_PTR,0) + 1;
  PIT0_TCTRL(0) = PIT0_TCTRL(0) + 1;
  PIT1_TCTRL(0) = PIT1_TCTRL(0) + 1;
  PIT_TCTRL_REG(PIT1_BASE_PTR,0) = PIT_TCTRL_REG(PIT1_BASE_PTR,0) + 1;
  PIT0_TCTRL(0) = PIT0_TCTRL(0) + 1;
  PIT1_TCTRL(0) = PIT1_TCTRL(0) + 1;
  (void)PIT_TCTRL_TEN_MASK;
  (void)PIT_TCTRL_TEN_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_TEN_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_TEN_SHIFT);
  (void)PIT_TCTRL_TIE_MASK;
  (void)PIT_TCTRL_TIE_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_TIE_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_TIE_SHIFT);
  (void)PIT_TCTRL_CHN_MASK;
  (void)PIT_TCTRL_CHN_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_CHN_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_CHN_SHIFT);
  PIT_TFLG_REG(PIT0_BASE_PTR,0) = PIT_TFLG_REG(PIT0_BASE_PTR,0) + 1;
  PIT0_TFLG(0) = PIT0_TFLG(0) + 1;
  PIT1_TFLG(0) = PIT1_TFLG(0) + 1;
  PIT_TFLG_REG(PIT1_BASE_PTR,0) = PIT_TFLG_REG(PIT1_BASE_PTR,0) + 1;
  PIT0_TFLG(0) = PIT0_TFLG(0) + 1;
  PIT1_TFLG(0) = PIT1_TFLG(0) + 1;
  (void)PIT_TFLG_TIF_MASK;
  (void)PIT_TFLG_TIF_SHIFT;
  PIT1_TFLG0 |= PIT_TFLG_TIF_MASK;
  PIT1_TFLG0 &= ~(1U << PIT_TFLG_TIF_SHIFT);
}

