kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM34Z5_v1_5.c
void test_RCM(void) {
  (void)RCM_BASE_PTR;
  RCM_RPFC = RCM_RPFC + 1;
  RCM_RPFW = RCM_RPFW + 1;
  (void)RCM_SRS0_WAKEUP_MASK;
  (void)RCM_SRS0_WAKEUP_SHIFT;
  RCM_SRS0 |= RCM_SRS0_WAKEUP_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_WAKEUP_SHIFT);
  (void)RCM_SRS0_LVD_MASK;
  (void)RCM_SRS0_LVD_SHIFT;
  RCM_SRS0 |= RCM_SRS0_LVD_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_LVD_SHIFT);
  (void)RCM_SRS0_LOC_MASK;
  (void)RCM_SRS0_LOC_SHIFT;
  RCM_SRS0 |= RCM_SRS0_LOC_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_LOC_SHIFT);
  (void)RCM_SRS0_LOL_MASK;
  (void)RCM_SRS0_LOL_SHIFT;
  RCM_SRS0 |= RCM_SRS0_LOL_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_LOL_SHIFT);
  (void)RCM_SRS0_WDOG_MASK;
  (void)RCM_SRS0_WDOG_SHIFT;
  RCM_SRS0 |= RCM_SRS0_WDOG_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_WDOG_SHIFT);
  (void)RCM_SRS0_PIN_MASK;
  (void)RCM_SRS0_PIN_SHIFT;
  RCM_SRS0 |= RCM_SRS0_PIN_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_PIN_SHIFT);
  (void)RCM_SRS0_POR_MASK;
  (void)RCM_SRS0_POR_SHIFT;
  RCM_SRS0 |= RCM_SRS0_POR_MASK;
  RCM_SRS0 &= ~(1U << RCM_SRS0_POR_SHIFT);
  (void)RCM_SRS1_LOCKUP_MASK;
  (void)RCM_SRS1_LOCKUP_SHIFT;
  RCM_SRS1 |= RCM_SRS1_LOCKUP_MASK;
  RCM_SRS1 &= ~(1U << RCM_SRS1_LOCKUP_SHIFT);
  (void)RCM_SRS1_SW_MASK;
  (void)RCM_SRS1_SW_SHIFT;
  RCM_SRS1 |= RCM_SRS1_SW_MASK;
  RCM_SRS1 &= ~(1U << RCM_SRS1_SW_SHIFT);
  (void)RCM_SRS1_MDM_AP_MASK;
  (void)RCM_SRS1_MDM_AP_SHIFT;
  RCM_SRS1 |= RCM_SRS1_MDM_AP_MASK;
  RCM_SRS1 &= ~(1U << RCM_SRS1_MDM_AP_SHIFT);
  (void)RCM_SRS1_SACKERR_MASK;
  (void)RCM_SRS1_SACKERR_SHIFT;
  RCM_SRS1 |= RCM_SRS1_SACKERR_MASK;
  RCM_SRS1 &= ~(1U << RCM_SRS1_SACKERR_SHIFT);
  RCM_RPFC_REG(RCM_BASE_PTR) = RCM_RPFC_REG(RCM_BASE_PTR) + 1;
  (void)RCM_RPFC_RSTFLTSRW_MASK;
  (void)RCM_RPFC_RSTFLTSRW_SHIFT;
  (void)RCM_RPFC_RSTFLTSRW(1);
  RCM_RPFC |= RCM_RPFC_RSTFLTSRW_MASK;
  RCM_RPFC &= ~(1U << RCM_RPFC_RSTFLTSRW_SHIFT);
  (void)RCM_RPFC_RSTFLTSS_MASK;
  (void)RCM_RPFC_RSTFLTSS_SHIFT;
  RCM_RPFC |= RCM_RPFC_RSTFLTSS_MASK;
  RCM_RPFC &= ~(1U << RCM_RPFC_RSTFLTSS_SHIFT);
  RCM_RPFW_REG(RCM_BASE_PTR) = RCM_RPFW_REG(RCM_BASE_PTR) + 1;
  (void)RCM_RPFW_RSTFLTSEL_MASK;
  (void)RCM_RPFW_RSTFLTSEL_SHIFT;
  (void)RCM_RPFW_RSTFLTSEL(1);
  RCM_RPFW |= RCM_RPFW_RSTFLTSEL_MASK;
  RCM_RPFW &= ~(1U << RCM_RPFW_RSTFLTSEL_SHIFT);
}

void test_RNG(void) {
  (void)RNG_BASE_PTR;
  RNG_CR = RNG_CR + 1;
  RNG_ER = RNG_ER + 1;
  RNG_CR_REG(RNG_BASE_PTR) = RNG_CR_REG(RNG_BASE_PTR) + 1;
  (void)RNG_CR_GO_MASK;
  (void)RNG_CR_GO_SHIFT;
  RNG_CR |= RNG_CR_GO_MASK;
  RNG_CR &= ~(1U << RNG_CR_GO_SHIFT);
  (void)RNG_CR_HA_MASK;
  (void)RNG_CR_HA_SHIFT;
  RNG_CR |= RNG_CR_HA_MASK;
  RNG_CR &= ~(1U << RNG_CR_HA_SHIFT);
  (void)RNG_CR_INTM_MASK;
  (void)RNG_CR_INTM_SHIFT;
  RNG_CR |= RNG_CR_INTM_MASK;
  RNG_CR &= ~(1U << RNG_CR_INTM_SHIFT);
  (void)RNG_CR_CLRI_MASK;
  (void)RNG_CR_CLRI_SHIFT;
  RNG_CR |= RNG_CR_CLRI_MASK;
  RNG_CR &= ~(1U << RNG_CR_CLRI_SHIFT);
  (void)RNG_CR_SLP_MASK;
  (void)RNG_CR_SLP_SHIFT;
  RNG_CR |= RNG_CR_SLP_MASK;
  RNG_CR &= ~(1U << RNG_CR_SLP_SHIFT);
  (void)RNG_SR_SECV_MASK;
  (void)RNG_SR_SECV_SHIFT;
  RNG_SR |= RNG_SR_SECV_MASK;
  RNG_SR &= ~(1U << RNG_SR_SECV_SHIFT);
  (void)RNG_SR_LRS_MASK;
  (void)RNG_SR_LRS_SHIFT;
  RNG_SR |= RNG_SR_LRS_MASK;
  RNG_SR &= ~(1U << RNG_SR_LRS_SHIFT);
  (void)RNG_SR_ORU_MASK;
  (void)RNG_SR_ORU_SHIFT;
  RNG_SR |= RNG_SR_ORU_MASK;
  RNG_SR &= ~(1U << RNG_SR_ORU_SHIFT);
  (void)RNG_SR_ERRI_MASK;
  (void)RNG_SR_ERRI_SHIFT;
  RNG_SR |= RNG_SR_ERRI_MASK;
  RNG_SR &= ~(1U << RNG_SR_ERRI_SHIFT);
  (void)RNG_SR_SLP_MASK;
  (void)RNG_SR_SLP_SHIFT;
  RNG_SR |= RNG_SR_SLP_MASK;
  RNG_SR &= ~(1U << RNG_SR_SLP_SHIFT);
  (void)RNG_SR_OREG_LVL_MASK;
  (void)RNG_SR_OREG_LVL_SHIFT;
  (void)RNG_SR_OREG_LVL(1);
  RNG_SR |= RNG_SR_OREG_LVL_MASK;
  RNG_SR &= ~(1U << RNG_SR_OREG_LVL_SHIFT);
  (void)RNG_SR_OREG_SIZE_MASK;
  (void)RNG_SR_OREG_SIZE_SHIFT;
  (void)RNG_SR_OREG_SIZE(1);
  RNG_SR |= RNG_SR_OREG_SIZE_MASK;
  RNG_SR &= ~(1U << RNG_SR_OREG_SIZE_SHIFT);
  RNG_ER_REG(RNG_BASE_PTR) = RNG_ER_REG(RNG_BASE_PTR) + 1;
  (void)RNG_ER_EXT_ENT_MASK;
  (void)RNG_ER_EXT_ENT_SHIFT;
  (void)RNG_ER_EXT_ENT(1);
  RNG_ER |= RNG_ER_EXT_ENT_MASK;
  RNG_ER &= ~(1U << RNG_ER_EXT_ENT_SHIFT);
  (void)RNG_OR_RANDOUT_MASK;
  (void)RNG_OR_RANDOUT_SHIFT;
  (void)RNG_OR_RANDOUT(1);
  RNG_OR |= RNG_OR_RANDOUT_MASK;
  RNG_OR &= ~(1U << RNG_OR_RANDOUT_SHIFT);
}

void test_ROM(void) {
  (void)ROM_BASE_PTR;
  (void)ROM_ENTRY_ENTRY_MASK;
  (void)ROM_ENTRY_ENTRY_SHIFT;
  (void)ROM_ENTRY_ENTRY(1);
  ROM_ENTRY0 |= ROM_ENTRY_ENTRY_MASK;
  ROM_ENTRY0 &= ~(1U << ROM_ENTRY_ENTRY_SHIFT);
  (void)ROM_TABLEMARK_MARK_MASK;
  (void)ROM_TABLEMARK_MARK_SHIFT;
  (void)ROM_TABLEMARK_MARK(1);
  ROM_TABLEMARK |= ROM_TABLEMARK_MARK_MASK;
  ROM_TABLEMARK &= ~(1U << ROM_TABLEMARK_MARK_SHIFT);
  (void)ROM_SYSACCESS_SYSACCESS_MASK;
  (void)ROM_SYSACCESS_SYSACCESS_SHIFT;
  (void)ROM_SYSACCESS_SYSACCESS(1);
  ROM_SYSACCESS |= ROM_SYSACCESS_SYSACCESS_MASK;
  ROM_SYSACCESS &= ~(1U << ROM_SYSACCESS_SYSACCESS_SHIFT);
  (void)ROM_PERIPHID4_PERIPHID_MASK;
  (void)ROM_PERIPHID4_PERIPHID_SHIFT;
  (void)ROM_PERIPHID4_PERIPHID(1);
  ROM_PERIPHID4 |= ROM_PERIPHID4_PERIPHID_MASK;
  ROM_PERIPHID4 &= ~(1U << ROM_PERIPHID4_PERIPHID_SHIFT);
  (void)ROM_PERIPHID5_PERIPHID_MASK;
  (void)ROM_PERIPHID5_PERIPHID_SHIFT;
  (void)ROM_PERIPHID5_PERIPHID(1);
  ROM_PERIPHID5 |= ROM_PERIPHID5_PERIPHID_MASK;
  ROM_PERIPHID5 &= ~(1U << ROM_PERIPHID5_PERIPHID_SHIFT);
  (void)ROM_PERIPHID6_PERIPHID_MASK;
  (void)ROM_PERIPHID6_PERIPHID_SHIFT;
  (void)ROM_PERIPHID6_PERIPHID(1);
  ROM_PERIPHID6 |= ROM_PERIPHID6_PERIPHID_MASK;
  ROM_PERIPHID6 &= ~(1U << ROM_PERIPHID6_PERIPHID_SHIFT);
  (void)ROM_PERIPHID7_PERIPHID_MASK;
  (void)ROM_PERIPHID7_PERIPHID_SHIFT;
  (void)ROM_PERIPHID7_PERIPHID(1);
  ROM_PERIPHID7 |= ROM_PERIPHID7_PERIPHID_MASK;
  ROM_PERIPHID7 &= ~(1U << ROM_PERIPHID7_PERIPHID_SHIFT);
  (void)ROM_PERIPHID0_PERIPHID_MASK;
  (void)ROM_PERIPHID0_PERIPHID_SHIFT;
  (void)ROM_PERIPHID0_PERIPHID(1);
  ROM_PERIPHID0 |= ROM_PERIPHID0_PERIPHID_MASK;
  ROM_PERIPHID0 &= ~(1U << ROM_PERIPHID0_PERIPHID_SHIFT);
  (void)ROM_PERIPHID1_PERIPHID_MASK;
  (void)ROM_PERIPHID1_PERIPHID_SHIFT;
  (void)ROM_PERIPHID1_PERIPHID(1);
  ROM_PERIPHID1 |= ROM_PERIPHID1_PERIPHID_MASK;
  ROM_PERIPHID1 &= ~(1U << ROM_PERIPHID1_PERIPHID_SHIFT);
  (void)ROM_PERIPHID2_PERIPHID_MASK;
  (void)ROM_PERIPHID2_PERIPHID_SHIFT;
  (void)ROM_PERIPHID2_PERIPHID(1);
  ROM_PERIPHID2 |= ROM_PERIPHID2_PERIPHID_MASK;
  ROM_PERIPHID2 &= ~(1U << ROM_PERIPHID2_PERIPHID_SHIFT);
  (void)ROM_PERIPHID3_PERIPHID_MASK;
  (void)ROM_PERIPHID3_PERIPHID_SHIFT;
  (void)ROM_PERIPHID3_PERIPHID(1);
  ROM_PERIPHID3 |= ROM_PERIPHID3_PERIPHID_MASK;
  ROM_PERIPHID3 &= ~(1U << ROM_PERIPHID3_PERIPHID_SHIFT);
  (void)ROM_COMPID_COMPID_MASK;
  (void)ROM_COMPID_COMPID_SHIFT;
  (void)ROM_COMPID_COMPID(1);
  ROM_COMPID0 |= ROM_COMPID_COMPID_MASK;
  ROM_COMPID0 &= ~(1U << ROM_COMPID_COMPID_SHIFT);
}

